IDENTIFICATION DIVISION.
PROGRAM-ID. DEMOMAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DFP1 PIC X(45) VALUE '1.1'.
01 DFP2 PIC X(45) VALUE '2.2'.
01 DFP3 PIC X(45) VALUE SPACES.
01 DFP3V PIC X(45) VALUE '3.3'.
01 INT1 PIC S9(8) COMP VALUE 1.
01 INT2 PIC S9(8) COMP VALUE 2.
01 INT3 PIC S9(8) COMP VALUE 0.
01 INT3V PIC S9(8) COMP VALUE 3.
PROCEDURE DIVISION.
DISPLAY UNDECLARED-VAR.

MAIN.
    DISPLAY 'DEMOMAIN.CBL SOA DEMO APPLICATION'
    PERFORM CALL-SUB1 5 TIMES
    PERFORM CALL-SUB2 5 TIMES
    DISPLAY 'DEMOMAIN.CBL ENDED OK'
    GOBACK.
RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
CALL-SUB1.
    CALL "DEMOSUB1" USING DFP1, DFP2, DFP3
    IF DFP3 NOT = DFP3V GO TO ABORT.
RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
CALL-SUB2.
    CALL "DEMOSUB2" USING INT1, INT2, INT3
    IF  INT3 NOT = INT3V GO TO ABORT.
RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
ABORT.
    DISPLAY 'DEMOMAIN.CBL SOA ERROR' 
    MOVE 16 TO RETURN-CODE
    STOP RUN.