IDENTIFICATION DIVISION.
PROGRAM-ID.    TESTMOV1.
AUTHOR.        DON HIGGINS.
* TEST MOVE ALIGNMENT  FOR NON FP TYPES
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  UNUSED-VAR PIC X(10) VALUE SPACES.

*> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
77  ZF30   PIC S9(3)    VALUE .
77  ZF31   PIC S9(3)V9  VALUE .
77  ZF32   PIC S9(3)V99 VALUE .
*> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE

77  PF30   COMP-3 PIC S9(3)    VALUE 123.
77  PF31   COMP-3 PIC S9(3)V9  VALUE 123.4.
77  PF32   COMP-3 PIC S9(3)V99 VALUE 123.45.

77  HF30   COMP-3 PIC S9(3)    VALUE .
77  HF31   COMP-3 PIC S9(3)V9  VALUE .
77  HF32   COMP-3 PIC S9(3)V99 VALUE .

77  FF30   COMP-3 PIC S9(3)    VALUE .
77  FF31   COMP-3 PIC S9(3)V9  VALUE .
77  FF32   COMP-3 PIC S9(3)V99 VALUE .

77  GF30   COMP-3 PIC S9(3)    VALUE .
77  GF31   COMP-3 PIC S9(3)V9  VALUE .
77  GF32   COMP-3 PIC S9(3)V99 VALUE .

77  QF30   COMP-3 PIC S9(3)    VALUE .
77  QF31   COMP-3 PIC S9(3)V9  VALUE .
77  QF32   COMP-3 PIC S9(3)V99 VALUE .

01  DF30   PIC X(5).
01  DF31   PIC X(5).
01  DF32   PIC X(5).

PROCEDURE DIVISION.
MAIN-PROGRAM.
    MOVE ZF30 TO DF30
    MOVE ZF31 TO DF31
    MOVE ZF32 TO DF32

    MOVE PF30 TO DF30
    MOVE PF31 TO DF31
    MOVE PF32 TO DF32

    MOVE HF30 TO DF30
    MOVE HF31 TO DF31
    MOVE HF32 TO DF32

    MOVE FF30 TO DF30
    MOVE FF31 TO DF31
    MOVE FF32 TO DF32

    MOVE GF30 TO DF30
    MOVE GF31 TO DF31
    MOVE GF32 TO DF32

    MOVE QF30 TO DF30
    MOVE QF31 TO DF31
    MOVE QF32 TO DF32

    DISPLAY 'TESTMOV2 GOOD TESTS =' GOOD
    STOP RUN.