PROCEDURE DIVISION.
   TEST.
      MOVE 1 TO RETURN-CODE.
      IF GOOD-TEST THEN
         ADD 1 TO G
         DISPLAY 'GOOD-TEST'.
      ELSE
         ADD 1 TO B
         DISPLAY 'BAD-TEST'.
```
This procedure first moves the value `1` to the variable `RETURN-CODE`. It then checks whether or not the current test is a "good" test (i.e., one that should succeed) by checking the value of the variable `GOOD-TEST`. If it is, the procedure adds `1` to the counter `G` and displays the message "GOOD-TEST". Otherwise, it adds `1` to the counter `B` and displays the message "BAD-TEST".

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and so on, as well as a third input that specifies whether or not to perform a "good" test (i.e., one that should succeed) or a "bad" test (i.e., one that should fail).

The program then enters a loop that iterates over all possible combinations of input values for the test function. For each combination, the program calls the `TEST` procedure, which is defined later in the program. The `TEST` procedure takes two inputs: `EH1`, `DH1`, and