IDENTIFICATION DIVISION.
PROGRAM-ID. WORK-WITH-STRING.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-FLAG PIC X VALUE 'N'.

    01 W-COUNT     PIC 999.
    01 W-STRING    PIC X(10) VALUE "HOHOHOHOHO".

PROCEDURE DIVISION.
IF WS-FLAG = 'Y'
    DISPLAY "FLAG-SET".
END-IF.

GO TO ERR-HANDLER.

DISPLAY "NORMAL-FLOW".

ERR-HANDLER.
    DISPLAY "ERROR-HANDLED".
    EXIT.

MAIN-PROCEDURE.

    PERFORM VARYING W-COUNT FROM 1 BY 1 UNTIL W-COUNT > 10
        DISPLAY W-STRING(W-COUNT:1)
    END-PERFORM

    GOBACK.