IDENTIFICATION DIVISION.
       PROGRAM-ID. hello-world.
       PROCEDURE DIVISION.
       DISPLAY UNDECLARED-VAR. *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
       GO TO ERR-HANDLER.
       DISPLAY "NORMAL-FLOW".
       ERR-HANDLER.
           DISPLAY "ERROR-HANDLED".
           EXIT.
           DISPLAY "Hello, world!" *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING