IDENTIFICATION DIVISION.
       PROGRAM-ID.   CBU00080.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT LogFile ASSIGN TO currentLogFile
                ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
        FD LogFile.
        01 LogLine PIC X(255).
       WORKING-STORAGE SECTION.
        COPY CBUC0002.
        LINKAGE SECTION.
         77 LogL PIC X(255).
        COPY CBUC0001.
       PROCEDURE DIVISION USING CBU-ctx LogL.
       INITIALIZE LogLine. *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
       DISPLAY LogL.
       MOVE LogL TO LogLine. *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
       OPEN EXTEND LogFile.
       WRITE LogLine.
       CLOSE LogFile.
       END PROGRAM CBU00080.