000047*> Display on screen a line after parsing blanks
000048* arg1: line-display - line to displau
000049 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.   CBU00200.
000093 DATA DIVISION.
000094  WORKING-STORAGE SECTION.
000113   COPY CBUC0002.
000114      77 WS-CNT PIC 999.
000115      77 l PIC X(255).
000116  LINKAGE SECTION.
000117   01 line-display PIC X(255).
000118   COPY CBUC0001.
000122 PROCEDURE DIVISION USING CBU-ctx line-display.
000153  MOVE line-display TO l.
000154  CALL CBU-get-last-index USING CBU-ctx l	WS-CNT.
000208 *> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000209* LOOP.
000210* END-LOOP.
000211*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000220  DISPLAY line-display(1:WS-CNT).
000221 END PROGRAM CBU00200.