IDENTIFICATION DIVISION.
       PROGRAM-ID.   CBU00103.
       DATA DIVISION.
        WORKING-STORAGE SECTION.
        COPY CBUC0002.
        LINKAGE SECTION.
        01 AssertName PIC X(20).
        01 expected-p USAGE IS POINTER.
        01 actual-p USAGE IS POINTER.
        COPY CBUC0001.
       PROCEDURE DIVISION
         USING CBU-ctx AssertName expected-p actual-p.
        *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
        OPEN OUTPUT nonExistentFile.
        *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING
        01 WS-CNT1 PIC 9(4) VALUE 10.
        01 WS-CNT2 PIC 9(4) VALUE 5.
        *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
        IF expected-p = actual-p THEN
          DISPLAY "EQUALITY"
        ELSE
          DISPLAY "NOT EQUAL"
        END-IF
        *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
       EXIT PROGRAM.
       END PROGRAM CBU00103.