000070 WORKING-STORAGE SECTION.
000080   COPY CBUC0002.
000081   LINKAGE SECTION.
000082   COPY CBUC0001.
000083 PROCEDURE DIVISION USING CBU-ctx.
000084 MAIN-LOGIC.
000085     PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10 *> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000086         CONTINUE
000087     END-PERFORM.
000088