000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   CTU0S3T1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080   COPY CBUC0002.
000081   LINKAGE SECTION.
000082   COPY CBUC0001.
000083 PROCEDURE DIVISION USING CBU-ctx.
000084 MAIN-LOGIC.
000085     *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
000086     COMPUTE WS-RESULT = WS-VALUE1 + WS-VALUE2 / 2.
000087     *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
000088     
000089     IF WS-RESULT NOT EQUAL TO 0 THEN
000090         CONTINUE.
000091     ELSE
000092         *> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000093         PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 10
000094             CONTINUE.
000095         END-PERFORM.
000096         *> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000097     END-IF.
000098     
000099 END PROGRAM CTU0S3T1.