000097 PROCEDURE DIVISION .
000098   INITIALIZE str1 str2.
000099   MOVE "SUITE2" TO str1.
000100   MOVE "DESC SUITE2" TO str2.
000101   CALL CBU-initialize USING CBU-ctx.
000102   CALL CBU-add-suite USING CBU-ctx str1 str2.
000108
000109 *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
000111   MOVE "TS000002" TO str1.
000112   MOVE "TEST2 desc" TO str2.
000114   CALL CBU-add-test-next USING CBU-ctx str1 str2.
000120 *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
000121  CALL CBU-run USING CBU-ctx.
000130 END PROGRAM SUITE002.