IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPROG10.
000300 AUTHOR.        COMPUWARE ISPW TRAINING.
000400 DATE-WRITTEN.  JANUARY 24TH, 1996.
000500 DATE-COMPILED.
000600
000700********************************************************
000800* THIS PROGRAM IS A TRAINING PROGRAM
000900*      WITH A LINK TO TSUBR10
001000*
001100*      AND COPYLIBS   TCPYA10   (HEADER)
001200*                     TCPYB10   (LINK AREA)
001300* ======================================================
001400*  ISPW (TM)
001500*  COPYRIGHT (C) 1986-2016 COMPUWARE CORPORATION.
001600*  UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT
001700*  LAWS OF THE UNITED STATES.
001800*
001900* ======================================================
002000*                   MODIFICATION  LOG
002100*
002200*  DD/MM/YY  PROGRAMMER  CHANGES
002300*  ********  **********  *******
002400*  96/01/24  ISPW        NEW PROGRAM
002500* ======================================================
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER. IBM-370.
002900 OBJECT-COMPUTER. IBM-370.
003000
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300
003400*****************************************************
003500*  FILES USED:
003600*   INPUT   JUST SOME DUMMY DATA TO READ IN
003700*   OUTPUT  A COPY OF THE DUMMY DATA WRITTEN OUT
003800*****************************************************
003900     SELECT INFILE  ASSIGN UT-S-INPUT
004000       ORGANIZATION IS SEQUENTIAL
004100       ACCESS IS SEQUENTIAL.
004200
004300     SELECT OUTFILE ASSIGN UT-S-OUTPUT
004400       ORGANIZATION IS SEQUENTIAL
004500       ACCESS IS SEQUENTIAL.
004600
004700 DATA DIVISION.
004800
004900 FILE SECTION.
005000
005100 FD  INFILE
005200     LABEL RECORDS OMITTED
005300     BLOCK CONTAINS 0 RECORDS
005400     RECORDING MODE IS F
005500     DATA RECORD IS INPUT-REC.
005600
005700 01  INPUT-REC         PIC X(80).
005800
005900 FD  OUTFILE
006000     LABEL RECORDS OMITTED
006100     BLOCK CONTAINS 0 RECORDS
006200     RECORDING MODE IS F
006300     DATA RECORD IS OUTPUT-REC.
006400
006500 01  OUTPUT-REC.
006600     05  CC                PIC X(1).
006700     05  OUTPUT-LINE       PIC X(132).
006800
006900
007000 WORKING-STORAGE SECTION.
007100****************************************************
007200****    THE DATA AREA COPYBOOK
007300****    THIS IS WHERE YOU DEFINE YOUR VARIABLES
007400****    AND OTHER DATA ITEMS.
007500****************************************************
007600 01  TEXT-PORTION      PIC X(80).
007700 01  BODY-TEXT         PIC X(132).
007800 01  MESSAGE-LINE      PIC X(132).
007900 01  ACTION-FLAG       PIC X(1).
008000 01  INFILE-EOF        PIC X(1).
008100 01  OUTFILE-EOF       PIC X(1).
008200
008300 PROCEDURE DIVISION.
008400     OPEN INPUT INFILE.
008500     OPEN OUTPUT OUTFILE.
008600
008700 GET-MESSAGE.
008800        MOVE 'R' TO ACTION-FLAG.
008900        CALL 'TSUBR10' USING PASS-ME-AROUND.
009000           IF NOT INFILE-EOF THEN
009100             MOVE TEXT-PORTION TO BODY-TEXT
009200             MOVE BODY-LINE TO OUTPUT-REC
009300             WRITE OUTPUT-REC.
009400 GET-MESSAGE-X.
009500     EXIT.