IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPROG06.
000300 AUTHOR.        COMPUWARE ISPW TRAINING.
000400 DATE-WRITTEN.  JANUARY 24TH, 1996.
000500 DATE-COMPILED.
000600
000700********************************************************
      * Adding a non-displayable character in the next line for
      * testing purposes (it's a x'00')
      *ï¿½
000800* THIS PROGRAM IS A TRAINING PROGRAM
000900*      WITH A LINK TO TSUBR06
001000*
001100*      AND COPYLIBS   TCPYA06   (HEADER)
001200*                     TCPYB06   (LINK AREA)
001300* ======================================================
001400*  ISPW (TM)
001500*  COPYRIGHT (C) 1986-2016 COMPUWARE CORPORATION.
001600*  UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT
001700*  LAWS OF THE UNITED STATES.
001800*
001900* ======================================================
002000*                   MODIFICATION  LOG
002100*
002200*  DD/MM/YY  PROGRAMMER  CHANGES
002300*  ********  **********  *******
002400*  96/01/24  ISPW        NEW PROGRAM
002500* ======================================================
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER. IBM-370.
002900 OBJECT-COMPUTER. IBM-370.
003000
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300
003400*****************************************************
003500*  FILES USED:
003600*   INPUT   JUST SOME DUMMY DATA TO READ IN
003700*   OUTPUT  A COPY OF THE DUMMY DATA WRITTEN OUT
003800*****************************************************
003900     SELECT INFILE  ASSIGN UT-S-INPUT
004000       ORGANIZATION IS SEQUENTIAL
004100       ACCESS IS SEQUENTIAL.
004200
004300     SELECT OUTFILE ASSIGN UT-S-OUTPUT
004400       ORGANIZATION IS SEQUENTIAL
004500       ACCESS IS SEQUENTIAL.
004600
004700 DATA DIVISION.
004800
004900 FILE SECTION.
005000
005100 FD  INFILE
005200     LABEL RECORDS OMITTED
005300     BLOCK CONTAINS 0 RECORDS
005400     RECORDING MODE IS F
005500     DATA RECORD IS INPUT-REC.
005600
005700 01  INPUT-REC         PIC X(80).
005800
005900 FD  OUTFILE
006000     LABEL RECORDS OMITTED
006100     BLOCK CONTAINS 0 RECORDS
006200     RECORDING MODE IS F
006300     DATA RECORD IS OUTPUT-REC.
006400
006500 01  OUTPUT-REC.
006600     05  CC                PIC X(1).
006700     05  OUTPUT-LINE       PIC X(132).
006800
006900
007000 WORKING-STORAGE SECTION.
007100****************************************************
007200****    THE DATA AREA COPYBOOK
007300****************************************************
007400 COPY TCPYA06.
007500
007600
007700****************************************************
007800**** A COPY MEMBER FOR THE LINK PARAMETERS
007900****************************************************
008000 01  PASS-ME-AROUND.
008100     05  ACTION-FLAG       PIC X(1).
008200     05  INFILE-EOF        PIC X(1).
008300     05  TEXT-PORTION      PIC X(80).
008400     05  BODY-TEXT         PIC X(80).
008500     05  MESSAGE-LINE      PIC X(132).
008600     05  STAR-LINE-1       PIC X(132).
008700     05  BODY-LINE         PIC X(132).
008800
008900 PROCEDURE DIVISION.
009000 MAIN-PROGRAM SECTION.
009100     PERFORM GET-MESSAGE THRU GET-MESSAGE-X
009200        UNTIL INFILE-EOF.
009300
009400* CLOSE THE INPUT FILE
009500     MOVE 'C' TO ACTION-FLAG.
009600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
009700
009800* CLOSE THE OUTPUT FILE
009900     MOVE 'C' TO ACTION-FLAG.
010000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
010100
010200* CLOSE THE INPUT AND OUTPUT FILES
010300     MOVE 'C' TO ACTION-FLAG.
010400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
010500
010600* CLOSE THE INPUT AND OUTPUT FILES
010700     MOVE 'C' TO ACTION-FLAG.
010800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
010900
011000* CLOSE THE INPUT AND OUTPUT FILES
011100     MOVE 'C' TO ACTION-FLAG.
011200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
011300
011400* CLOSE THE INPUT AND OUTPUT FILES
011500     MOVE 'C' TO ACTION-FLAG.
011600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
011700
011800* CLOSE THE INPUT AND OUTPUT FILES
011900     MOVE 'C' TO ACTION-FLAG.
012000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
012100
012200* CLOSE THE INPUT AND OUTPUT FILES
012300     MOVE 'C' TO ACTION-FLAG.
012400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
012500
012600* CLOSE THE INPUT AND OUTPUT FILES
012700     MOVE 'C' TO ACTION-FLAG.
012800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
012900
013000* CLOSE THE INPUT AND OUTPUT FILES
013100     MOVE 'C' TO ACTION-FLAG.
013200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
013300
013400* CLOSE THE INPUT AND OUTPUT FILES
013500     MOVE 'C' TO ACTION-FLAG.
013600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
013700
013800* CLOSE THE INPUT AND OUTPUT FILES
013900     MOVE 'C' TO ACTION-FLAG.
014000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
014100
014200* CLOSE THE INPUT AND OUTPUT FILES
014300     MOVE 'C' TO ACTION-FLAG.
014400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
014500
014600* CLOSE THE INPUT AND OUTPUT FILES
014700     MOVE 'C' TO ACTION-FLAG.
014800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
014900
015000* CLOSE THE INPUT AND OUTPUT FILES
015100     MOVE 'C' TO ACTION-FLAG.
015200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
015300
015400* CLOSE THE INPUT AND OUTPUT FILES
015500     MOVE 'C' TO ACTION-FLAG.
015600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
015700
015800* CLOSE THE INPUT AND OUTPUT FILES
015900     MOVE 'C' TO ACTION-FLAG.
016000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
016100
016200* CLOSE THE INPUT AND OUTPUT FILES
016300     MOVE 'C' TO ACTION-FLAG.
016400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
016500
016600* CLOSE THE INPUT AND OUTPUT FILES
016700     MOVE 'C' TO ACTION-FLAG.
016800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
016900
017000* CLOSE THE INPUT AND OUTPUT FILES
017100     MOVE 'C' TO ACTION-FLAG.
017200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
017300
017400* CLOSE THE INPUT AND OUTPUT FILES
017500     MOVE 'C' TO ACTION-FLAG.
017600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
017700
017800* CLOSE THE INPUT AND OUTPUT FILES
017900     MOVE 'C' TO ACTION-FLAG.
018000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
018100
018200* CLOSE THE INPUT AND OUTPUT FILES
018300     MOVE 'C' TO ACTION-FLAG.
018400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
018500
018600* CLOSE THE INPUT AND OUTPUT FILES
018700     MOVE 'C' TO ACTION-FLAG.
018800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
018900
019000* CLOSE THE INPUT AND OUTPUT FILES
019100     MOVE 'C' TO ACTION-FLAG.
019200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
019300
019400* CLOSE THE INPUT AND OUTPUT FILES
019500     MOVE 'C' TO ACTION-FLAG.
019600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
019700
019800* CLOSE THE INPUT AND OUTPUT FILES
019900     MOVE 'C' TO ACTION-FLAG.
020000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
020100
020200* CLOSE THE INPUT AND OUTPUT FILES
020300     MOVE 'C' TO ACTION-FLAG.
020400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
020500
020600* CLOSE THE INPUT AND OUTPUT FILES
020700     MOVE 'C' TO ACTION-FLAG.
020800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
020900
021000* CLOSE THE INPUT AND OUTPUT FILES
021100     MOVE 'C' TO ACTION-FLAG.
021200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
021300
021400* CLOSE THE INPUT AND OUTPUT FILES
021500     MOVE 'C' TO ACTION-FLAG.
021600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
021700
021800* CLOSE THE INPUT AND OUTPUT FILES
021900     MOVE 'C' TO ACTION-FLAG.
022000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
022100
022200* CLOSE THE INPUT AND OUTPUT FILES
022300     MOVE 'C' TO ACTION-FLAG.
022400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
022500
022600* CLOSE THE INPUT AND OUTPUT FILES
022700     MOVE 'C' TO ACTION-FLAG.
022800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
022900
023000* CLOSE THE INPUT AND OUTPUT FILES
023100     MOVE 'C' TO ACTION-FLAG.
023200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
023300
023400* CLOSE THE INPUT AND OUTPUT FILES
023500     MOVE 'C' TO ACTION-FLAG.
023600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
023700
023800* CLOSE THE INPUT AND OUTPUT FILES
023900     MOVE 'C' TO ACTION-FLAG.
024000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
024100
024200* CLOSE THE INPUT AND OUTPUT FILES
024300     MOVE 'C' TO ACTION-FLAG.
024400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
024500
024600* CLOSE THE INPUT AND OUTPUT FILES
024700     MOVE 'C' TO ACTION-FLAG.
024800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
024900
025000* CLOSE THE INPUT AND OUTPUT FILES
025100     MOVE 'C' TO ACTION-FLAG.
025200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
025300
025400* CLOSE THE INPUT AND OUTPUT FILES
025500     MOVE 'C' TO ACTION-FLAG.
025600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
025700
025800* CLOSE THE INPUT AND OUTPUT FILES
025900     MOVE 'C' TO ACTION-FLAG.
026000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
026100
026200* CLOSE THE INPUT AND OUTPUT FILES
026300     MOVE 'C' TO ACTION-FLAG.
026400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
026500
026600* CLOSE THE INPUT AND OUTPUT FILES
026700     MOVE 'C' TO ACTION-FLAG.
026800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
026900
027000* CLOSE THE INPUT AND OUTPUT FILES
027100     MOVE 'C' TO ACTION-FLAG.
027200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
027300
027400* CLOSE THE INPUT AND OUTPUT FILES
027500     MOVE 'C' TO ACTION-FLAG.
027600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
027700
027800* CLOSE THE INPUT AND OUTPUT FILES
027900     MOVE 'C' TO ACTION-FLAG.
028000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
028100
028200* CLOSE THE INPUT AND OUTPUT FILES
028300     MOVE 'C' TO ACTION-FLAG.
028400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
028500
028600* CLOSE THE INPUT AND OUTPUT FILES
028700     MOVE 'C' TO ACTION-FLAG.
028800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
028900
029000* CLOSE THE INPUT AND OUTPUT FILES
029100     MOVE 'C' TO ACTION-FLAG.
029200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
029300
029400* CLOSE THE INPUT AND OUTPUT FILES
029500     MOVE 'C' TO ACTION-FLAG.
029600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
029700
029800* CLOSE THE INPUT AND OUTPUT FILES
029900     MOVE 'C' TO ACTION-FLAG.
030000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
030100
030200* CLOSE THE INPUT AND OUTPUT FILES
030300     MOVE 'C' TO ACTION-FLAG.
030400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
030500
030600* CLOSE THE INPUT AND OUTPUT FILES
030700     MOVE 'C' TO ACTION-FLAG.
030800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
030900
031000* CLOSE THE INPUT AND OUTPUT FILES
031100     MOVE 'C' TO ACTION-FLAG.
031200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
031300
031400* CLOSE THE INPUT AND OUTPUT FILES
031500     MOVE 'C' TO ACTION-FLAG.
031600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
031700
031800* CLOSE THE INPUT AND OUTPUT FILES
031900     MOVE 'C' TO ACTION-FLAG.
032000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
032100
032200* CLOSE THE INPUT AND OUTPUT FILES
032300     MOVE 'C' TO ACTION-FLAG.
032400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
032500
032600* CLOSE THE INPUT AND OUTPUT FILES
032700     MOVE 'C' TO ACTION-FLAG.
032800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
032900
033000* CLOSE THE INPUT AND OUTPUT FILES
033100     MOVE 'C' TO ACTION-FLAG.
033200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
033300
033400* CLOSE THE INPUT AND OUTPUT FILES
033500     MOVE 'C' TO ACTION-FLAG.
033600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
033700
033800* CLOSE THE INPUT AND OUTPUT FILES
033900     MOVE 'C' TO ACTION-FLAG.
034000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
034100
034200* CLOSE THE INPUT AND OUTPUT FILES
034300     MOVE 'C' TO ACTION-FLAG.
034400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
034500
034600* CLOSE THE INPUT AND OUTPUT FILES
034700     MOVE 'C' TO ACTION-FLAG.
034800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
034900
035000* CLOSE THE INPUT AND OUTPUT FILES
035100     MOVE 'C' TO ACTION-FLAG.
035200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
035300
035400* CLOSE THE INPUT AND OUTPUT FILES
035500     MOVE 'C' TO ACTION-FLAG.
035600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
035700
035800* CLOSE THE INPUT AND OUTPUT FILES
035900     MOVE 'C' TO ACTION-FLAG.
036000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
036100
036200* CLOSE THE INPUT AND OUTPUT FILES
036300     MOVE 'C' TO ACTION-FLAG.
036400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
036500
036600* CLOSE THE INPUT AND OUTPUT FILES
036700     MOVE 'C' TO ACTION-FLAG.
036800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
036900
037000* CLOSE THE INPUT AND OUTPUT FILES
037100     MOVE 'C' TO ACTION-FLAG.
037200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
037300
037400* CLOSE THE INPUT AND OUTPUT FILES
037500     MOVE 'C' TO ACTION-FLAG.
037600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
037700
037800* CLOSE THE INPUT AND OUTPUT FILES
037900     MOVE 'C' TO ACTION-FLAG.
038000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
038100
038200* CLOSE THE INPUT AND OUTPUT FILES
038300     MOVE 'C' TO ACTION-FLAG.
038400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
038500
038600* CLOSE THE INPUT AND OUTPUT FILES
038700     MOVE 'C' TO ACTION-FLAG.
038800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
038900
039000* CLOSE THE INPUT AND OUTPUT FILES
039100     MOVE 'C' TO ACTION-FLAG.
039200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
039300
039400* CLOSE THE INPUT AND OUTPUT FILES
039500     MOVE 'C' TO ACTION-FLAG.
039600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
039700
039800* CLOSE THE INPUT AND OUTPUT FILES
039900     MOVE 'C' TO ACTION-FLAG.
040000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
040100
040200* CLOSE THE INPUT AND OUTPUT FILES
040300     MOVE 'C' TO ACTION-FLAG.
040400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
040500
040600* CLOSE THE INPUT AND OUTPUT FILES
040700     MOVE 'C' TO ACTION-FLAG.
040800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
040900
041000* CLOSE THE INPUT AND OUTPUT FILES
041100     MOVE 'C' TO ACTION-FLAG.
041200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
041300
041400* CLOSE THE INPUT AND OUTPUT FILES
041500     MOVE 'C' TO ACTION-FLAG.
041600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
041700
041800* CLOSE THE INPUT AND OUTPUT FILES
041900     MOVE 'C' TO ACTION-FLAG.
042000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
042100
042200* CLOSE THE INPUT AND OUTPUT FILES
042300     MOVE 'C' TO ACTION-FLAG.
042400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
042500
042600* CLOSE THE INPUT AND OUTPUT FILES
042700     MOVE 'C' TO ACTION-FLAG.
042800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
042900
043000* CLOSE THE INPUT AND OUTPUT FILES
043100     MOVE 'C' TO ACTION-FLAG.
043200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
043300
043400* CLOSE THE INPUT AND OUTPUT FILES
043500     MOVE 'C' TO ACTION-FLAG.
043600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
043700
043800* CLOSE THE INPUT AND OUTPUT FILES
043900     MOVE 'C' TO ACTION-FLAG.
044000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
044100
044200* CLOSE THE INPUT AND OUTPUT FILES
044300     MOVE 'C' TO ACTION-FLAG.
044400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
044500
044600* CLOSE THE INPUT AND OUTPUT FILES
044700     MOVE 'C' TO ACTION-FLAG.
044800     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
044900
045000* CLOSE THE INPUT AND OUTPUT FILES
045100     MOVE 'C' TO ACTION-FLAG.
045200     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
045300
045400* CLOSE THE INPUT AND OUTPUT FILES
045500     MOVE 'C' TO ACTION-FLAG.
045600     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
045700
045800* CLOSE THE INPUT AND OUTPUT FILES
045900     MOVE 'C' TO ACTION-FLAG.
046000     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
046100
046200* CLOSE THE INPUT AND OUTPUT FILES
046300     MOVE 'C' TO ACTION-FLAG.
046400     PERFORM GET-MESSAGE THRU GET-MESSAGE-X.
046500