IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPROG08.
000300 AUTHOR.        COMPUWARE ISPW TRAINING.
000400 DATE-WRITTEN.  JANUARY 24TH, 1996.
000500 DATE-COMPILED.
000600
000700********************************************************
000800* THIS PROGRAM IS A TRAINING PROGRAM
000900*      WITH A LINK TO TSUBR08
001000*
001100*      AND COPYLIBS   TCPYA08   (HEADER)
001200*                     TCPYB08   (LINK AREA)
001300* ======================================================
001400*  ISPW (TM)
001500*  COPYRIGHT (C) 1986-2016 COMPUWARE CORPORATION.
001600*  UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT
001700*  LAWS OF THE UNITED STATES.
001800*
001900* ======================================================
002000*                   MODIFICATION  LOG
002100*
002200*  DD/MM/YY  PROGRAMMER  CHANGES
002300*  ********  **********  *******
002400*  96/01/24  ISPW        NEW PROGRAM
002500* ======================================================
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER. IBM-370.
002900 OBJECT-COMPUTER. IBM-370.
003000
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300
003400*****************************************************
003500*  FILES USED:
003600*   INPUT   JUST SOME DUMMY DATA TO READ IN
003700*   OUTPUT  A COPY OF THE DUMMY DATA WRITTEN OUT
003800*****************************************************
003900     SELECT INFILE  ASSIGN UT-S-INPUT
004000       ORGANIZATION IS SEQUENTIAL
004100       ACCESS IS SEQUENTIAL.
004200
004300     SELECT OUTFILE ASSIGN UT-S-OUTPUT
004400       ORGANIZATION IS SEQUENTIAL
004500       ACCESS IS SEQUENTIAL.
004600
004700 DATA DIVISION.
004800
004900 FILE SECTION.
005000
005100 FD  INFILE
005200     LABEL RECORDS OMITTED
005300     BLOCK CONTAINS 0 RECORDS
005400     RECORDING MODE IS F
005500     DATA RECORD IS INPUT-REC.
005600
005700 01  INPUT-REC         PIC X(80).
005800
005900 FD  OUTFILE
006000     LABEL RECORDS OMITTED
006100     BLOCK CONTAINS 0 RECORDS
006200     RECORDING MODE IS F
006300     DATA RECORD IS OUTPUT-REC.
006400
006500 01  OUTPUT-REC.
006600     05  CC                PIC X(1).
006700     05  OUTPUT-LINE       PIC X(132).
006800
006900
007000 WORKING-STORAGE SECTION.
007100****************************************************
007200****    THE DATA AREA COPYBOOK
007300****************************************************
007400 COPY TCPYA08.
007500
007600
007700****************************************************
007800**** A COPY MEMBER FOR THE LINKAGE AREA PARAMETERS
007900****************************************************
008000 COPY TCPYB08 .
008100
008200 PROCEDURE DIVISION.
008300
008400* RUNTIME BUG 1: UNINITIALIZED VARIABLE USED
008500     MOVE 'R' TO ACTION-FLAG.
008600     CALL 'TSUBR08' USING PASS-ME-AROUND.
008700        IF NOT INFILE-EOF THEN
008800          MOVE TEXT-PORTION TO BODY-TEXT
008900          MOVE BODY-LINE TO OUTPUT-REC
009000          WRITE OUTPUT-REC.
009100 GET-MESSAGE.
009200        MOVE 'R' TO ACTION-FLAG.
009300        CALL 'TSUBR08' USING PASS-ME-AROUND.
009400           IF NOT INFILE-EOF THEN
009500             MOVE TEXT-PORTION TO BODY-TEXT
009600             MOVE BODY-LINE TO OUTPUT-REC
009700             WRITE OUTPUT-REC.
009800 GET-MESSAGE-X.
009900     EXIT.
010000
010100* RUNTIME BUG 2: DIVIDE BY ZERO ERROR
010200     MOVE 'R' TO ACTION-FLAG.
010300     CALL 'TSUBR08' USING PASS-ME-AROUND.
010400        IF NOT INFILE-EOF THEN
010500          MOVE TEXT-PORTION TO BODY-TEXT
010600          MOVE BODY-LINE TO OUTPUT-REC
010700          WRITE OUTPUT-REC.
010800 GET-MESSAGE.
010900        MOVE 'R' TO ACTION-FLAG.
011000        CALL 'TSUBR08' USING PASS-ME-AROUND.
011100           IF NOT INFILE-EOF THEN
011200             MOVE TEXT-PORTION TO BODY-TEXT
011300             MOVE BODY-LINE TO OUTPUT-REC
011400             WRITE OUTPUT-REC.
011500 GET-MESSAGE-X.
011600     EXIT.