006400 PROCEDURE DIVISION USING PASS-ME-AROUND.
006500 00000-MAIN-PROCEDURE.
006600     IF NOT INFILE-OPEN THEN
006700        MOVE 'Y' TO INFILE-OPEN-FLAG
006800        MOVE 'N' TO INFILE-EOF-FLAG
006900        OPEN INPUT INFILE.
007000     *> RUNTIME_BUG_START TYPE=DIVIDE_BY_ZERO_RISK
007100     MOVE 1 TO DIVIDEND
007200     DIVIDE DIVIDEND BY ZERO GIVING QUOTIENT.
007300     *> RUNTIME_BUG_END TYPE=DIVIDE_BY_ZERO_RISK
007400     MOVE SPACES TO INCOMING-DATA.
007500     IF ACTION-READ THEN
007600        PERFORM GET-ME-A-RECORD THRU GET-ME-A-RECORD-X
007700        UNTIL INFILE-EOF OR KEEPER.
007800     IF ACTION-CLOSE THEN
007900        CLOSE INFILE.
008000     GOBACK.
008100 GET-ME-A-RECORD.
008200     READ INFILE AT END MOVE 'Y' TO INFILE-EOF-FLAG.
008300     IF NOT INFILE-EOF MOVE INPUT-REC TO INCOMING-DATA.
008400 GET-ME-A-RECORD-X.
008500     EXIT.