IDENTIFICATION DIVISION.
        PROGRAM-ID. SD002000.
      *>
      *> THIS IS THE MAIN PROGRAM FOR THE SDESIGN COMMAND. THIS IS THE
      *> "SCREEN DESIGNER" PROGRAM, THAT THE USER USES FOR DEFINING
      *> SCREENS, FIELDS, STATES, CHARACTER SETS ETC. FOR THE GENERATION
      *> OF COBOL SCREEN CODE.
      *>
        DATA DIVISION.
        WORKING-STORAGE SECTION.

       01  WS-FLAG PIC X VALUE 'N'.

            COPY COBCURSG.

        PROCEDURE DIVISION.

       IF WS-FLAG = 'Y'
           DISPLAY "FLAG-SET".
       END-IF.

        MAIN-PROGRAM.
            *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
            PERFORM NC-OPEN.
            *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING

            CALL "SD002010"
              USING
                BY REFERENCE NC-COBCURSES.

            *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
            DISPLAY WS-UNINITIALIZED-DATA.
            *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE

            PERFORM NC-CLOSE.
            STOP RUN.

       DISPLAY "UNREACHABLE-STATEMENT".

        COPY COBCURSP.

        END PROGRAM SD002000.