        PROGRAM-ID. SHLIB-TEST.
      *
      * THIS PROGRAM IS USED BY ./configure :
      *
      * THIS PROGRAM DOES NOTHING. IT IS USED ONLY TO
      * COMPILE INTO A MODULE, TO SEE WHAT THE INSTALLED
      * OPEN COBOL COMPILER USES AS A SUFFIX FOR
      * MODULES.
      *
        PROCEDURE DIVISION.
       GO TO ERR-HANDLER.

       DISPLAY "NORMAL-FLOW".

       ERR-HANDLER.
           DISPLAY "ERROR-HANDLED".
           EXIT.

            STOP RUN.
       DISPLAY "UNREACHABLE-STATEMENT".

        END PROGRAM SHLIB-TEST.
