IDENTIFICATION DIVISION.
        PROGRAM-ID. TEST-CURSES.

        ENVIRONMENT DIVISION.

        DATA DIVISION.

        WORKING-STORAGE SECTION.

       01  WS-FLAG PIC X VALUE 'N'.

            COPY COBCURSG.

            01  WORK-VARS.
                10  WS-PAIRS                PIC 999.
                10  WS-MS                   PIC 9(9).

        PROCEDURE DIVISION.

       IF WS-FLAG = 'Y'
           DISPLAY "FLAG-SET".
       END-IF.

        MAIN-PROG.
            *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
            PERFORM NC-OPEN.
            *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING

            PERFORM NC-CLOSE.

            DISPLAY "COBCURSES REPORTS:".
            DISPLAY "  COLUMNS.........", NC-COLUMNS.
            DISPLAY "  LINES...........", NC-LINES.
            DISPLAY "  HAS-COLOUR......", NC-CAP-COLOUR.
            DISPLAY "  CHG-COLOUR......", NC-CHG-COLOUR.

            *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
            MOVE NC-COLOUR-PAIRS TO WS-PAIRS.
            *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC

            DISPLAY "  COLOUR-PAIRS....", WS-PAIRS.
            DISPLAY "  HAS-UNDERLINE...", NC-HAS-UNDERLINE-FLAG.
            DISPLAY "  MOUSE-SUPPORT...", NC-MOUSE-SUPPORT.
            MOVE NC-MOUSE-CLICK-MS TO WS-MS.
            DISPLAY "  MOUSE-CLICK-MS..", WS-MS.

            STOP RUN.

            COPY COBCURSP.

        END PROGRAM TEST-CURSES.