IDENTIFICATION DIVISION.
PROGRAM-ID. hello-world.
PROCEDURE DIVISION.
DISPLAY UNDECLARED-VAR.

GO TO ERR-HANDLER.

DISPLAY "NORMAL-FLOW".

ERR-HANDLER.
    DISPLAY "ERROR-HANDLED".
    EXIT.

    *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
    DISPLAY UNDECLARED-VAR.
    *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE

    DISPLAY "Hello, world!"