IDENTIFICATION DIVISION.
       PROGRAM-ID. WGRVGCUS.
       ENVIRONMENT DIVISION.

       DATA DIVISION.

      *****************************************************************
      ** VARIABLES FOR INTERACTING WITH THE TERMINAL SESSION          *
      *****************************************************************
       WORKING-STORAGE SECTION.

       01  WS-FLAG PIC X VALUE 'N'.

       01  UNUSED-VAR PIC X(10) VALUE SPACES.

       01 CUST-REC-KEY.
           05 NAME                        PIC X(30)  VALUE SPACES.

       01  CUSTOMER-RECORD.
           05 CUSTOMER-NAME               PIC X(30).
           05 CUSTOMER-SSN                PIC X(9).
           05 CUSTOMER-ADDRESS.
              10 CUSTOMER-STREET          PIC X(20).
              10 CUSTOMER-CITY            PIC X(10).
              10 CUSTOMER-STATE           PIC X(4).
              10 CUSTOMER-ZIP             PIC 9(5).
           05 CUSTOMER-PHONE              PIC X(13).
           05 CUSTOMER-ACCESS-PIN         PIC X(4).

       01 ACCT-REC-KEY.
           05 SSN                         PIC X(9)   VALUE SPACES.
           05 NUM                         PIC X(10)  VALUE SPACES.

       01  ACCOUNT-RECORD.
           05 ACCOUNT-SSN                 PIC X(9).
           05 ACCOUNT-NUMBER              PIC X(10).
           05 ACCOUNT-TYPE.
              10 ACCOUNT-TYPE-CODE        PIC X.
                 88 ACCOUNT-TYPE-CHK            VALUE 'C'.
                 88 ACCOUNT-TYPE-SAV            VALUE 'S'.
              10 ACCOUNT-TYPE-NAME        PIC X(10).
           05 ACCOUNT-AREA                PIC X(39).
           05 ACCOUNT-TYPE-CHECKING REDEFINES ACCOUNT-AREA.
              10 ACCOUNT-CHK-OD-CHG       PIC S9(3)V99   COMP-3.
              10 ACCOUNT-CHK-OD-LIMIT     PIC S9(5)V99   COMP-3.
              10 ACCOUNT-CHK-OD-LINK-ACCT PIC X(10).
              10 ACCOUNT-CHK-LAST-STMT    PIC X(10).
              10 ACCOUNT-CHK-DETAIL-ITEMS PIC S9(7)      COMP-3.
              10 ACCOUNT-CHK-BAL          PIC S9(13)V99  COMP-3.
           05 ACCOUNT-TYPE-SAVINGS  REDEFINES ACCOUNT-AREA.
              10 ACCOUNT-SAV-INT-RATE     PIC S9(1)V99   COMP-3.
              10 ACCOUNT-SAV-SVC-CHRG     PIC S9(3)V99   COMP-3.
              10 ACCOUNT-SAV-LAST-STMT    PIC X(10).
              10 ACCOUNT-SAV-DETAIL-ITEMS PIC S9(7)      COMP-3.
              10 ACCOUNT-SAV-BAL          PIC S9(13)V99  COMP-3.
              10 FILLER                   PIC X(12).

       01 TXN-REC-KEY.
           05 SSN                         PIC X(9)   VALUE SPACES.
           05 NUM                         PIC X(10)  VALUE SPACES.

       01  TXN-RECORD.
           05 TRANSACTION-TYPE            PIC X(2).
           05 TRANSACTION-AMOUNT          PIC S9(7)V99 COMP-3.

       01  TOTAL-AMOUNT                  PIC S9(10)V99 VALUE 0.

       01  WRONG-TOTAL-AMOUNT            PIC S9(10)V99 VALUE 0. *> WRONG CALCULATION

       01  EDITED-TOTAL-AMOUNT           PIC ZZ,ZZZ,ZZZ.99.

       01  EDITED-WRONG-TOTAL-AMOUNT     PIC ZZ,ZZZ,ZZZ.99.

       PROCEDURE DIVISION.
           *> WRONG CALCULATION OF TOTAL AMOUNT
           *> SHOULD BE ADDING TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS SUBTRACTING
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> START OF WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT TO TOTAL-AMOUNT
           *> BUT HERE IT IS:
           *> SUBTRACT TRANSACTION-AMOUNT FROM TOTAL-AMOUNT
           *> THIS WILL CAUSE A WRONG-TOTAL-AMOUNT

           *> WRONG CALCULATION
           *> SHOULD BE:
           *> ADD TRANSACTION-AMOUNT