IDENTIFICATION DIVISION.
PROGRAM-ID. CONCURRENT-SERVER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  TRACE-ID PIC X(8).
02  LOG-MSG-BUFFER PIC X(50).
03  HW-LENGTH PIC S9(4) COMP-4 VALUE ZERO.
04  TASK-NUMBER PIC S9(4) COMP-4 VALUE ZERO.
05  CHILD-SERVER-ERROR PIC X(8).
PROCEDURE DIVISION.
TRACE-POINTS SECTION.
    EVALUATE TRACE-ID
        WHEN 'CSMT'
            MOVE SPACES TO LOG-MSG-BUFFER.
            MOVE 'START OF CONCURRENT SERVER' TO LOG-MSG-BUFFER.
            PERFORM WRITE-LOG-MSG THRU WRITE-LOG-MSG-EXIT.
        WHEN OTHER
            MOVE TRACE-ID TO EDIT-NUM-3.
            STRING 'UNKNOWN TRACE-ID VALUE OF: ' DELIMITED SIZE
                EDIT-NUM-3 DELIMITED SIZE
                INTO LOG-MSG-BUFFER.
            PERFORM WRITE-LOG-MSG THRU WRITE-LOG-MSG-EXIT.
    END-EVALUATE.
WRITE-LOG-MSG SECTION.
    IF LOGGING-IS-ENABLED THEN
        MOVE LENGTH OF LOG-MSG TO HW-LENGTH
        MOVE EIBTASKN TO TASK-NUMBER
        EXEC CICS WRITEQ TD QUEUE('CSMT')
            FROM(LOG-MSG)
            LENGTH(HW-LENGTH)
            NOHANDLE
        END-EXEC
    END-IF.
CLOSE-THE-SOCKET SECTION.
    MOVE SPACES TO LOG-MSG-BUFFER.
    MOVE 'END OF CONCURRENT SERVER' TO LOG-MSG-BUFFER.
    PERFORM WRITE-LOG-MSG THRU WRITE-LOG-MSG-EXIT.
    EXEC CICS RETURN END-EXEC.
EXIT-THE-PROGRAM SECTION.
    GOBACK.