IDENTIFICATION DIVISION.
PROGRAM-ID. WTISCUSI.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-FLAG PIC X VALUE 'N'.
01 CUST-REC-KEY.
    05 NAME                        PIC X(30)  VALUE SPACES.
01  CUSTOMER-RECORD.
    05 CUSTOMER-NAME               PIC X(30).
    05 CUSTOMER-SSN                PIC X(9).
    05 CUSTOMER-ADDRESS.
        10 CUSTOMER-STREET          PIC X(20).
        10 CUSTOMER-CITY            PIC X(10).
        10 CUSTOMER-STATE           PIC X(4).
        10 CUSTOMER-ZIP             PIC 9(5).
    05 CUSTOMER-PHONE              PIC X(13).
    05 CUSTOMER-ACCESS-PIN         PIC X(4).
PROCEDURE DIVISION.
IF WS-FLAG = 'Y'
    DISPLAY "FLAG-SET".
END-IF.
GO TO ERR-HANDLER.
DISPLAY "NORMAL-FLOW".
ERR-HANDLER.
    DISPLAY "ERROR-HANDLED".
    EXIT.
MOVE 0 TO SERRORCODE RET-CODE
         SRETURNERRORTOCLIENT.
MOVE SPACES TO BSTRHELPSTRING.
PERFORM UPDATE-CUST THRU UPDATE-CUST-EXIT.
IF SERRORCODE NOT = 0 THEN
    MOVE 1 TO SRETURNERRORTOCLIENT
END-IF.
EXEC CICS RETURN END-EXEC.
* **************************************************
* READ THE CUSTOMER SSN FROM THE VSAM DATA SET
* **************************************************
UPDATE-CUST.
    MOVE CUSTOMER-NAME OF USER-DATA TO NAME OF CUST-REC-KEY.
    EXEC CICS READ
              DATASET(WBCUSTDB-DD)
              INTO(CUSTOMER-RECORD)
              LENGTH(LENGTH OF CUSTOMER-RECORD)
              KEYLENGTH(LENGTH OF CUST-REC-KEY)
              RIDFLD(CUST-REC-KEY)
              RESP(RESP-CODE)
              UPDATE
    END-EXEC.
    EVALUATE RESP-CODE
        WHEN 0
            IF CUSTOMER-SSN OF USER-DATA NOT =
                CUSTOMER-SSN OF CUSTOMER-RECORD THEN
                GO TO UPDATE-CUST-BADSSN
            END-IF
            MOVE 0 TO RET-CODE
        WHEN DFHRESP(NOTOPEN)
            GO TO UPDATE-CUST-NOTOPEN
        WHEN DFHRESP(DISABLED)
            GO TO UPDATE-CUST-NOTOPEN
        WHEN DFHRESP(ENDFILE)
            GO TO UPDATE-CUST-NOTFND
        WHEN DFHRESP(NOTFND)
            GO TO UPDATE-CUST-NOTFND
        WHEN OTHER
            GO TO UPDATE-CUST-ERROR
    END-EVALUATE.
    MOVE CORRESPONDING USER-DATA TO CUSTOMER-RECORD.
    EXEC CICS REWRITE
              DATASET(WBCUSTDB-DD)
              FROM(CUSTOMER-RECORD)
              LENGTH(LENGTH OF CUSTOMER-RECORD)
              RESP(RESP-CODE)
    END-EXEC.
    EVALUATE RESP-CODE
        WHEN 0
            MOVE 0 TO RET-CODE
            GO TO UPDATE-CUST-EXIT
        WHEN OTHER
            GO TO UPDATE-CUST-ERROR
    END-EVALUATE.
    GO TO UPDATE-CUST-EXIT.
UPDATE-CUST-NOTOPEN.
    MOVE 'Customer file not open' TO BSTRHELPSTRING.
    MOVE 5001 TO SERRORCODE RET-CODE.
    GO TO UPDATE-CUST-EXIT.
UPDATE-CUST-NOTFND.
    EXEC CICS UNLOCK
              DATASET(WBCUSTDB-DD)
              RESP(RESP-CODE)
    END-EXEC.
    MOVE 'Customer name not found' TO BSTRHELPSTRING.
    MOVE 5002 TO SERRORCODE RET-CODE.
    GO TO UPDATE-CUST-EXIT.
UPDATE-CUST-ERROR.
    MOVE SPACES TO BSTRHELPSTRING.
    MOVE RESP-CODE TO EDIT-NUM.
    STRING 'I/O Error one Customer file, response code='
                 DELIMITED SIZE
          EDIT-NUM  DELIMITED SIZE
          INTO BSTRHELPSTRING
    END-STRING.
    MOVE 5003 TO SERRORCODE RET-CODE.
    GO TO UPDATE-CUST-EXIT.
UPDATE-CUST-BADSSN.
    EXEC CICS UNLOCK
              DATASET(WBCUSTDB-DD)
              RESP(RESP-CODE)
    END-EXEC.
    MOVE 'Customer SSN not valid' TO BSTRHELPSTRING.
    MOVE 5004 TO SERRORCODE RET-CODE.
    GO TO UPDATE-CUST-EXIT.
UPDATE-CUST-EXIT.
    EXIT.
* *****************************************************************
* WRITE A MESSAGE OUT TO A CICS TRANSIENT DATA QUEUE
* *****************************************************************
WRITE-LOG-MSG.
    IF LOGGING-IS-ENABLED THEN
        MOVE LENGTH OF LOG-MSG TO HW-LENGTH
        MOVE EIBTASKN          TO TASK-NUMBER
        EXEC CICS WRITEQ TD QUEUE('CSMT')
                    FROM(LOG-MSG)
                    LENGTH(HW-LENGTH)
                    NOHANDLE
        END-EXEC
    END-IF.
WRITE-LOG-MSG-EXIT.
    EXIT.