* THIS PROGRAM CALCULATES ZPI FOR ABE
      * ZPI FROM 4(1 - 1/3 + 1/5 - 1/7 ETC.)
      *
      * Author: James Francis Cray
      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZPI.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.

       01  COUNTER        PIC 9(05)      VALUE 1.
       01  ITERATIONS     PIC 9(05)      VALUE 9999.
       01  TERM           PIC S9999V9999 VALUE +0.
       01  TEMP1          PIC S9999V9999 VALUE +0.
       01  TEMP2          PIC S9999V9999 VALUE +0.
       01  TEMP3          PIC S9999V9999 VALUE +0.
       01  TEMP4          PIC S9999V9999 VALUE +0.
       01  FAC            PIC S9         VALUE 1.
       01  FAC1           PIC S9         VALUE 0.
       01  MYSUM          PIC S9999V9999 VALUE +0.
       01  MYSUM1         PIC S9999V9999 VALUE +0.
       01  THANKS         PIC X(30)      VALUE
           'ABE THANKS FOR WATCHING ZPI '.
       
       PROCEDURE DIVISION.
       BEGIN.
           DISPLAY 'ABE HELLO'.
           *> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
           PERFORM MYLOOP WITH TEST AFTER
               VARYING COUNTER FROM 1 BY 1
               UNTIL COUNTER GREATER THAN ITERATIONS.
           *> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
           MULTIPLY MYSUM BY 4.00000 GIVING MYSUM1.
           DISPLAY ' ABE ZPI CALCULATED TO BE:'.
           DISPLAY MYSUM1.
           DISPLAY THANKS.
           STOP RUN.

       DISPLAY "UNREACHABLE-STATEMENT".

       MYLOOP.
           *> RUNTIME_BUG_START TYPE=DIVIDE_BY_ZERO_RISK
           DIVIDE 1.0 BY TEMP2 GIVING TEMP3.
           *> RUNTIME_BUG_END TYPE=DIVIDE_BY_ZERO_RISK
           MULTIPLY TEMP3 BY FAC GIVING TEMP4.
           SUBTRACT FAC FROM 0 GIVING FAC1.
           MOVE FAC1 TO FAC.
           ADD TEMP4 TO MYSUM.