IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTFUN1.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  10/13/08.
      * TEST FUNCTIONS - LENGTH OF, ADDRESS OF                              
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.

       77 PTR-1   USAGE POINTER.    
       77 PTR-2   USAGE POINTER.           
       77 PTR-3   USAGE POINTER.           
       77 W1      PIC 9(9) COMP VALUE 0.           
       77 ADDR-1  PIC X(20).
       77 ADDR-2  PIC X(20).
       77 TP1     COMP-3 PIC S9.
       77 TP2     COMP-3 PIC S9.
       77 TZ1     PIC S9.
       77 TZ2     PIC S99.
       77 TX3     PIC X(3).
       77 TRM1    PIC X(3) VALUE 'ABC'.
      * THE FOLLOWING 3 TYPES ARE MAPPED TO DFP USING FLOAT(DECIMAL)
      * NOTE: FLOAT(DECIMAL) IS THE DEFAULT 
       77 FLT-SRT FLOAT-SHORT.
       77 FLT-LNG FLOAT-LONG. 
       77 FLT-EXT FLOAT-EXTENDED.
      * THE FOLLOWING 9 TYPES ALWAYS MAP TO HFP, BFP, AND DFP.
       77 HFP-SRT FLOAT-HEX-7      VALUE 1234567.
       77 HFP-LNG FLOAT-HEX-15     VALUE 123456789012345.
       77 HFP-EXT FLOAT-HEX-30 
                  VALUE 123456789012345678901234567890.
       77 BFP-SRT FLOAT-BINARY-7   VALUE 1234567.
       77 BFP-LNG FLOAT-BINARY-16  VALUE 1234567890123456.
       77 BFP-EXT FLOAT-BINARY-34
                  VALUE 1234567890123456789012345678901234.
       77 DFP-SRT FLOAT-DECIMAL-7  VALUE 1234567.
       77 DFP-LNG FLOAT-DECIMAL-16 VALUE 1234567890123456.
       77 DFP-EXT FLOAT-DECIMAL-34
                  VALUE 1234567890123456789012345678901234.
      * THE FOLLOWING 4 TYPES DEFINE 16, 32, 64, AND 128 BINARY TYPES
      * NOTE 39 DIGIT QW LIMITED TO 34 DIGITS TO FIT IN BFP/DFP_EXT
       77 HW      COMP PIC S9(4)  VALUE 1234.
       77 FW      COMP PIC S9(9)  VALUE 123456789.
       77 DW      COMP PIC S9(18) VALUE 123456789012345.
       77 QW      COMP PIC S9(39) VALUE 1234567890123456789012345678901234.
       77 RETURN-CODE PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
           DISPLAY 'STARTING TESTFUN1'.
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *>
*> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *> *