IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTTRC3.
       AUTHOR.        DON HIGGINS.
      * TEST ON SIZE ERROR WITH TRUNC AND NOR64.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-FLAG PIC X VALUE 'N'.

        77  HW1     COMP PIC S9(4).
        77  FW1     COMP PIC S9(9).
        77  GW1     COMP PIC S9(18).
        77  GOOD   COMP PIC S9(9) VALUE 0.
       PROCEDURE DIVISION.
       IF WS-FLAG = 'Y'
           DISPLAY "FLAG-SET".
       END-IF.

       GO TO ERR-HANDLER.

       DISPLAY "NORMAL-FLOW".

       ERR-HANDLER.
           DISPLAY "ERROR-HANDLED".
           EXIT.

       MAINLINE.
           MOVE 9998 TO HW1
           ADD  1    TO HW1 ON SIZE ERROR MOVE 1 TO HW1 END-ADD
     1     IF HW1 NOT = 9999 PERFORM BAD ELSE PERFORM GOOD.
           ADD  1    TO HW1 ON SIZE ERROR MOVE 1 TO HW1 END-ADD
     2     IF HW1 NOT = 1    PERFORM BAD ELSE PERFORM GOOD.
           MOVE 999999998 TO FW1
           ADD  1    TO FW1 ON SIZE ERROR MOVE 1 TO FW1 END-ADD
     3     IF FW1 NOT = 999999999 PERFORM BAD ELSE PERFORM GOOD.
           ADD  1    TO FW1 ON SIZE ERROR MOVE 1 TO FW1 END-ADD
     4     IF FW1 NOT = 1    PERFORM BAD ELSE PERFORM GOOD.
           MOVE 999999999999999998 TO GW1
           ADD  1    TO GW1 ON SIZE ERROR MOVE 1 TO GW1 END-ADD
     5     IF GW1 NOT = 999999999999999999 
                             PERFORM BAD ELSE PERFORM GOOD.
           ADD  1    TO GW1 ON SIZE ERROR MOVE 1 TO GW1 END-ADD
     6     IF GW1 NOT = 1    PERFORM BAD ELSE PERFORM GOOD.
           DISPLAY 'TESTTRC3 GOOD TESTS =' GOOD 
           STOP RUN.
       GOOD.
           *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
           ADD 2 TO GOOD
           *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
       BAD.
           MOVE 16 TO RETURN-CODE
           STOP RUN.