IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-3270.
DATA DIVISION.
WORKING-STORAGE SECTION.
       01  WS-FLAG PIC X VALUE 'N'.
    COPY COBCATTR.                                      *> DEFINE TERMINAL ATTRIBUTES
    COPY COBCCOLOUR.                                    *> DEFINE TERMINAL COLOURS
    COPY COBCURSG.                                      *> COBCURSES GLOBAL DEFNS
    COPY COBCURSL.                                      *> COBCURSES LOCAL DEFNS FOR SCREEN
    COPY 3270TEST-WS.                                   *> GENERATED SCREEN WS DATA ITEMS
PROCEDURE DIVISION.
       IF WS-FLAG = 'Y'
           DISPLAY "FLAG-SET".
       END-IF.
MAIN-PROGRAM.
    PERFORM 1000-INITIALIZE.
    PERFORM 5000-PROCESS.
    PERFORM 9000-FINALIZE.
    *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
    DISPLAY "    FLD-ITEM-NUMBER='", FLD-ITEM-NUMBER, "'".
    *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
    DISPLAY "  FLD-CUSTOMER-NAME='", FLD-CUSTOMER-NAME, "'".
    DISPLAY "      FLD-ADDRESS-1='", FLD-ADDRESS-1, "'".
    DISPLAY "      FLD-ADDRESS-2='", FLD-ADDRESS-2, "'".
    DISPLAY "           FLD-CITY='", FLD-CITY, "'".
    DISPLAY " FLD-STATE-PROVINCE='", FLD-STATE-PROVINCE, "'".
    DISPLAY "        FLD-COUNTRY='", FLD-COUNTRY, "'".
    DISPLAY "  FLD-HOME-PHONE-NO='", FLD-HOME-PHONE-NO, "'".
    DISPLAY "  FLD-CELL-PHONE-NO='", FLD-CELL-PHONE-NO, "'".
    DISPLAY "     FLD-FAX-NUMBER='", FLD-FAX-NUMBER, "'".
    DISPLAY "  FLD-EMAIL-ADDRESS='", FLD-EMAIL-ADDRESS, "'".
    DISPLAY "      FLD-VISA-FLAG='", FLD-VISA-FLAG, "'".
    DISPLAY "FLD-MASTERCARD-FLAG='", FLD-MASTERCARD-FLAG, "'".
    DISPLAY "    FLD-CARD-ZONE-1='", FLD-CARD-ZONE-1, "'".
    DISPLAY "    FLD-CARD-ZONE-2='", FLD-CARD-ZONE-2, "'".
    DISPLAY "    FLD-CARD-ZONE-3='", FLD-CARD-ZONE-3, "'".
    DISPLAY "    FLD-CARD-ZONE-4='", FLD-CARD-ZONE-4, "'".
    DISPLAY "  FLD-SECURITY-CODE='", FLD-SECURITY-CODE, "'".
    DISPLAY "-----------------------------------------".
    DISPLAY "     NC-FIELD-EXIT = '", NC-FIELD-EXIT, "'".
    DISPLAY "     NC-FIELD-FKEY = ", NC-FIELD-FKEY-NO.
    STOP RUN.
1000-INITIALIZE.
    PERFORM NC-OPEN.                                    *> OPEN TERMINAL (NORMALLY DONE BY A MAIN PROGRAM)
    PERFORM NC-INIT-3270.                               *> INITIALIZE COBCURSES FOR 3270 MODE SCREEN
    MOVE 'Y' TO NC-FKEY-EXEMPT(03).                     *> ALLOW F3 FKEY EXEMPTION (FROM VALIDATION)
    MOVE 'Y' TO NC-FKEY-EXEMPT(12).                     *> ALLOW F12 FKEY EXEMPTION
    COPY 3270TEST-PD.                                   *> INITIALIZE THIS SCREEN'S WS DATA ITEMS
    PERFORM NC-DRAW-SCREEN.                             *> PAINT THE BACKGROUND ON THIS SCREEN
    PERFORM NC-CLEAR-FIELDS.                            *> CLEAR ALL SCREEN FIELDS TO BLANKS
    PERFORM NC-DRAW-FIELDS.                             *> DRAW ALL FIELDS ON THE SCREEN
    EXIT.
5000-PROCESS.
    PERFORM NC-3270-STATE-MACHINE.                      *> ALLOW THE USER TO EDIT THE 3270 FORM
    EXIT.
9000-FINALIZE.
    PERFORM NC-FINALIZE.                                *> CURRENT SCREEN CLEANUP
    PERFORM NC-CLOSE.                                   *> CLOSE TERMINAL (NORMALLY A MAIN PGM OPERATION)
    EXIT.
COPY COBCURSP.                                      *> FOR NC-OPEN/NC-CLOSE
COPY COBCURSQ.                                      *> ALL OTHER NC-* SCREEN SUPPORT PARAGRAPHS
COPY COBC3270.                                      *> 3270 MODE ONLY SUPPORT PARAGRAPHS
END PROGRAM TEST-3270.