IDENTIFICATION DIVISION.
PROGRAM-ID. EDPR010.
DATA DIVISION.
WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.
    COPY COBCATTR.
    COPY COBCCOLOUR.
    COPY COBCKEYS.
    COPY COBCURSL.                                      *> LOCAL STUFF FOR COBCURSQ PARAGRAPHS
    COPY EDPR010-WS.                                    *> SCREEN LOCALS
LINKAGE SECTION.
    COPY COBCURSG.                                      *> DEFINE COBCURSES GLOBALS
PROCEDURE DIVISION USING NC-COBCURSES.
MAIN.
    PERFORM 1000-INITIALIZE.
    PERFORM 5000-PROCESS.
    *> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
    PERFORM 9000-FINALIZE UNTIL NC-COBCURSES = 'END'.
    *> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
    GOBACK.
1000-INITIALIZE.
    PERFORM NC-INIT.                                    *> INITIALIZE LOCALS
    COPY EDPR010-PD.
    PERFORM NC-DRAW-SCREEN.                             *> PAINT SCREEN BACKGROUND
    EXIT.
5000-PROCESS.
    PERFORM NC-PAUSE.
    EXIT.
9000-FINALIZE.
    EXIT.
COPY COBCURSQ.                                          *> OTHER SCREEN STUFF
COPY NULLEVENTS.
END PROGRAM EDPR010.