IDENTIFICATION DIVISION.
       PROGRAM-ID. COBCURSES-EXTRA-INT-OPTIONS.
      *>
      *> THIS IS AN INTERNAL SUPPORT ROUTINE THAT SIMPLY
      *> GATHERS A NUMBER OF PIC X OPTIONS INTO A SINGLE
      *> STRING, FOR EASE OF PARAMETER PASSING.
      *>
       DATA DIVISION.
       LINKAGE SECTION.
           01  WS-OPTION-FLAGS     PIC X(3).
               COPY COBCEXTRA.

       PROCEDURE DIVISION
         USING COBCURSES-EXTRAS, WS-OPTION-FLAGS.

           *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
           MOVE NC-CSV-DELIMITER TO WS-OPTION-FLAGS(1:1).
           *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
           MOVE NC-CSV-MULT-DEL-FLAG TO WS-OPTION-FLAGS(2:1).
           MOVE NC-CSV-QUOTE-CONVENTION TO WS-OPTION-FLAGS(3:1).
           GOBACK.

       END PROGRAM COBCURSES-EXTRA-INT-OPTIONS.