IDENTIFICATION DIVISION.
PROGRAM-ID. SD002070.
*>
*> Warren W. Gay
*>
*> THIS IS THE GENERATION SCREEN MODULE. THIS SCREEN PERMITS THE USER TO
*> PERFORM AN INTERACTIVE CODE GENERATION, ALLOWING SELECTIVE OPTIONS
*> FOR WORKING-STORAGE SECTION CODE, PROCEDURE DIVISION CODE, AND/OR
*> SCREEN IMAGE TEXT FILE.
*>
*> INPUTS :
*> 
*>     NC-COBCURSES            COBCURSES GLOBAL & WORK AREAS
*>     LS-SCREEN-NAME          THE SCREEN NAME TO GENERATE FOR
*>
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SCREEN-FILE
        ASSIGN TO SCREEN-FILE-NAME
        ORGANIZATION IS INDEXED
        ACCESS IS DYNAMIC
        RECORD KEY IS SCN-NAME.

DATA DIVISION.
FILE SECTION.

    FD  SCREEN-FILE.
    01  SCREEN-RECORD.
        COPY SCREEN-01.

WORKING-STORAGE SECTION.

       01  UNUSED-VAR PIC X(10) VALUE SPACES.

    COPY COBCRETC.
    COPY COBCATTR.
    COPY COBCCOLOUR.
    COPY COBCURSL.

    COPY SD002070-WS.

    01  FILE-NAMES.
        10  FILE-NAME-LENGTH                PIC 9999.
        10  SCREEN-FILE-NAME                PIC X(512)      VALUE "${COBCURSES_DATADIR}/SCREENS.X".

    01  WS-CODE-GENERATOR.
        10  WS-CODE-FILENAME                PIC X(16).      *> WORKING-STORAGE SECTION CODE FILE
        10  PD-CODE-FILENAME                PIC X(16).      *> PROCEDURE DIVISION CODE FILE
        10  SI-TEXT-FILENAME                PIC X(16).      *> SCREEN IMAGE FILE

    01  WS-DIRECTORIES.
        10  WS-COPY-BOOK-DIR                PIC X(512).     *> COPY BOOK DIRECTORY
        10  WS-SCREEN-IMAGE-DIR             PIC X(512).     *> SCREEN IMAGE DIRECTORY

    01  COUNT-SEGMENTS                      PIC 9999.
    01  COUNT-FIELDS                        PIC 9999.
    01  COUNT-STATES                        PIC 9999.
    01  COUNT-MENUS                         PIC 9999.
    01  COUNT-ITEMS                         PIC 9999.
    01  SCREEN-DESCRIPTION                  PIC X(50).

    01  WS-FLAGS.
        10  WS-SCREEN-TOO-SMALL-FLAG    PIC X VALUE 'N'.
            88  WS-SCREEN-TOO-SMALL     VALUE 'Y' FALSE IS 'N'.

LINKAGE SECTION.

    COPY COBCURSG.

    01  LS-SCREEN-NAME              PIC X(16).

PROCEDURE DIVISION
    USING NC-COBCURSES, LS-SCREEN-NAME.

MAIN-PROGRAM.
    PERFORM 1000-INITIALIZATION.
    IF NOT WS-SCREEN-TOO-SMALL THEN
        PERFORM 5000-PROCESS
    END-IF.
    PERFORM 9000-FINALIZE.
    EXIT PROGRAM.

1000-INITIALIZATION.
    MOVE SPACES TO WS-COPY-BOOK-DIR.
    MOVE SPACES TO WS-SCREEN-IMAGE-DIR.

    *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
    MOVE FNO-ACTION TO NC-FSEQ-STATE.
    *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC

    MOVE LENGTH OF SCREEN-FILE-NAME TO FILE-NAME-LENGTH.
    CALL "COBCURSES-INIT-PATHNAME" USING SCREEN-FILE-NAME, 
        WS-CODE-FILENAME, PD-CODE-FILENAME, SI-TEXT-FILENAME,
        WS-COPY-BOOK-DIR, WS-SCREEN-IMAGE-DIR, 
        COUNT-SEGMENTS, COUNT-FIELDS, COUNT-STATES, COUNT-MENUS, COUNT-ITEMS
        SCREEN-DESCRIPTION.

    INITIALIZE NC-MSGBUF.

    IF RETURN-CODE = NC-RET-OK THEN
        STRING COUNT-SEGMENTS, " SEGMENTS, ", COUNT-FIELDS, " FIELDS, ", COUNT-STATES, " STATES, ",
            COUNT-MENUS, " MENUS, ", COUNT-ITEMS, " ITEMS ",
            "GENERATED FOR ", LS-SCREEN-NAME
            INTO NC-MSGBUF
        PERFORM NC-PUT-MESSAGE-CR
        PERFORM 5300-ACTION-E
    ELSE
        STRING "ERROR: ", LS-SCREEN-NAME, " IS NOT ON FILE." INTO NC-MSGBUF
        PERFORM NC-PUT-ERROR-CR
    END-IF.
    EXIT.

COPY COBCURSQ.

END PROGRAM SD002070.