000046*> add test to the current suite
000047 IDENTIFICATION DIVISION.
000048 PROGRAM-ID.   CBU00012.
000049 ENVIRONMENT    DIVISION.
000050 DATA DIVISION.
000067 WORKING-STORAGE SECTION.
000068    01 nb-suite-pos PIC 9(2).
000070 COPY CBUC0002.
000072 LINKAGE SECTION.
000073    01 Nom PIC X(20) VALUE SPACES.
000074    01 Desc PIC X(100) VALUE SPACES.
000076   COPY CBUC0001.
000086 PROCEDURE DIVISION USING CBU-ctx Nom Desc.
000087  MOVE 0 TO nb-suite-pos.
000096*> DISPLAY "Suite Index (ds add test)="SuiteIndex.
000097  COMPUTE nb-suite-pos = SuiteIndex - 1.
000098*> DISPLAY "Add test to Suite("nb-suite-pos")" .
000103  CALL CBU-add-test USING CBU-ctx nb-suite-pos Nom Desc.
000110 END PROGRAM CBU00012.