000110* arg1: NomTest-Test name to run
000120  IDENTIFICATION DIVISION.
000130  PROGRAM-ID.   CBU00002.
000140  DATA DIVISION.
000150    WORKING-STORAGE SECTION.
000161    01 LineToLog PIC X(255).
000170    01 NomRunTest  PIC X(20) VALUES SPACES.
000171    COPY CBUC0002.
000180    LINKAGE SECTION.
000190    01 NomTest PIC X(20).
000191    COPY CBUC0001.
000200
000210   PROCEDURE DIVISION USING CBU-ctx NomTest.
000230          ADD 1 TO TestRunCount
000260          MOVE NomTest TO name-current-test.
000261          INITIALIZE LineToLog.
000288          INITIALIZE LineToLog.
000289          CALL NomTest USING CBU-ctx
000290                  ON EXCEPTION CALL CBU-add-error USING CBU-ctx.
000328   EXIT PROGRAM.
000330  END PROGRAM CBU00002.