000052    SELECT LogFile ASSIGN TO currentLogFile
000054          ORGANIZATION IS LINE SEQUENTIAL.
000060 DATA DIVISION.
000061 FILE SECTION.
000062  FD LogFile.
000063  01 LogLine PIC X(255).
000070 WORKING-STORAGE SECTION.
000071  COPY CBUC0002.
000072   LINKAGE SECTION.
000073    77 LogL PIC X(255).
000074    COPY CBUC0001.
000075
000080 PROCEDURE DIVISION USING CBU-ctx LogL.
000081 INITIALIZE LogLine.
000083 DISPLAY LogL.
000085* MOVE LogL TO LogLine.
000090* Write Log
000092*  OPEN EXTEND LogFile.
000093*  WRITE LogLine.
000094*  CLOSE LogFile.
000100 END PROGRAM CBU00080.