000045*> Run Suites test
000046 IDENTIFICATION DIVISION.
000047 PROGRAM-ID.   CBU00006.
000048 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000071   01 i PIC 9(2).
000081   01 str PIC X(32000).
000082   01 WS-CNT PIC 99999.
000090   COPY CBUC0002.
000091   LINKAGE SECTION.
000092   COPY CBUC0001.
000093 PROCEDURE DIVISION USING CBU-ctx.
000094   PERFORM VARYING i FROM 1 BY 1
000095          UNTIL i >= SuiteIndex
000096          INITIALIZE log-entete-suite
000097          INITIALIZE str
000098*> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
000099          DISPLAY "|--- " SuiteName(i)
000100          MOVE SuiteName (i) TO str
000110          CALL CBU-suite-run USING CBU-ctx i
000115  IF nb-test-error(i) > 0 OR nb-test-failed(i) > 0 THEN
000125          DISPLAY "|--- FAILURE"
000135  ELSE
000145  DISPLAY "|--- SUCCESS"
000146  END-IF
000147  DISPLAY ""
000151  END-PERFORM
000152  EXIT PROGRAM.
000160 END PROGRAM CBU00006.