000045*> Run  tests
000046 IDENTIFICATION DIVISION.
000047 PROGRAM-ID.   CBU00008.
000048 ENVIRONMENT    DIVISION.
000049 CONFIGURATION  SECTION.
000050 DATA DIVISION.
000051 WORKING-STORAGE SECTION.
000052  01 j PIC 9(2).
000053  COPY CBUC0002.
000054 LINKAGE SECTION.
000055  COPY CBUC0001.
000056 PROCEDURE DIVISION USING CBU-ctx.
000057  PERFORM VARYING j FROM 1 BY 1
000058                  UNTIL j>nb-test-size(index-current-suite)
000059*                 MOVE 1 TO index-current-assert
000060          CALL CBU-test-run USING CBU-ctx j
000061  END-PERFORM
000062   EXIT PROGRAM.
000063 END PROGRAM CBU00008.