000094          01 RES PIC 99.
*> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
000095 PROCEDURE DIVISION.
000096   INITIALIZE str1 str2.
000097   MOVE "SUITE1" TO str1.
000098   MOVE "DESC SUITE1" TO str2.
000099   CALL CBU-initialize USING CBU-ctx.
000102   CALL CBU-add-suite USING CBU-ctx str1 str2.
000103
000104   INITIALIZE str1 str2.
000105   MOVE "TS000001" TO str1.
000106   MOVE "TEST1 desc" TO str2.
000108   CALL CBU-add-test-next USING CBU-ctx str1 str2.
000109
000121   CALL CBU-run USING CBU-ctx.
*> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE