IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTFUN1.
       AUTHOR.        DON HIGGINS.
       DATE-WRITTEN.  10/13/08.
      * TEST FUNCTIONS - LENGTH OF, ADDRESS OF                              
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.

       77 PTR-1   USAGE POINTER.    
       77 PTR-2   USAGE POINTER.           
       77 PTR-3   USAGE POINTER.           
       77 W1      PIC 9(9) COMP VALUE 0.           
       77 ADDR-1  PIC X(20).
       77 ADDR-2  PIC X(20).
       77 TP1     COMP-3 PIC S9.
       77 TP2     COMP-3 PIC S9.
       77 TZ1     PIC S9.
       77 TZ2     PIC S99.
       77 TX3     PIC X(3).
       77 TRM1    PIC X(3) VALUE 'ABC'.
      * THE FOLLOWING 3 TYPES ARE MAPPED TO DFP USING FLOAT(DECIMAL)
      * NOTE: FLOAT(DECIMAL) IS THE DEFAULT 
       77 FLT-SRT FLOAT-SHORT.
       77 FLT-LNG FLOAT-LONG. 
       77 FLT-EXT FLOAT-EXTENDED.
      * THE FOLLOWING 9 TYPES ALWAYS MAP TO HFP, BFP, AND DFP.
       77 HFP-SRT FLOAT-HEX-7      VALUE 1234567.
       77 HFP-LNG FLOAT-HEX-15     VALUE 123456789012345.
       77 HFP-EXT FLOAT-HEX-30 
                  VALUE 123456789012345678901234567890.
       77 BFP-SRT FLOAT-BINARY-7   VALUE 1234567.
       77 BFP-LNG FLOAT-BINARY-16  VALUE 123456789012345.
      * THE FOLLOWING LINE IS INCORRECT AND SHOULD BE REMOVED OR FIXED
      * MOVE 1 TO Q1 TO BFP-EXT DISPLAY 'BFP-EXT 1 =' BFP-EXT IF Q1 = 1 PERFORM GOOD ELSE PERFORM BAD.
       77 Q1    PIC S9(18) VALUE 0 COMP-3.
      * THE FOLLOWING LINE IS INCORRECT AND SHOULD BE REMOVED OR FIXED
      * MOVE -1 TO Q1 TO BFP-EXT DISPLAY 'BFP-EXT -1 =' BFP-EXT IF Q1 = -1 PERFORM GOOD ELSE PERFORM BAD.
       77 P1    PIC S9(31) VALUE 0 COMP-3.
       PROCEDURE DIVISION.
           MOVE 0 TO GOOD.
           DISPLAY 'TESTFUN1 GOOD TESTS =' GOOD
           STOP RUN.