IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTBEC6.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.
        77  RECAREA  PIC X(80).
        77  RECLEN   PIC 9(4) COMP.
        01  TEST1.
            02  FILLER  PIC X(4)  VALUE X'C311C1D1'.
            02  FILLER  PIC X(59)
                VALUE 'TESTBEC6 TEST 1:PRESS AID KEY TO HANDLE ASRA ABEN
      -               'D BY LABEL'.
        77  TEST1L   PIC 9(4) COMP.
        01  TEST1R.
            02  FILLER  PIC X(4)  VALUE X'C311C261'.
            02  FILLER  PIC X(33)
                        VALUE 'TESTBEC6 ASRA HANDLED OK BY LABEL'.
            02  FILLER  PIC X(3)  VALUE X'11C3F1'.
            02  FILLER  PIC X(59)
                VALUE 'TESTBEC6 TEST 2:PRESS AID KEY TO HANDLE AEI0 ABEN
      -               'D BY LABEL'.
        77  TEST1RL  PIC 9(4) COMP.
        01  TEST2R.
            02  FILLER  PIC X(4)  VALUE X'C311C5C1'.
            02  FILLER  PIC X(33)
                        VALUE 'TESTBEC6 AEI0 HANDLED OK BY LABEL'.
            02  FILLER  PIC X(3)  VALUE X'11C6D1'.
            02  FILLER  PIC X(61)
                VALUE 'TESTBEC6 TEST 3:PRESS AID KEY TO HANDLE ASRA ABEN
      -               'D BY PROGRAM'.
        77  TEST2RL  PIC 9(4) COMP.
        01  TEST4.
            02  FILLER  PIC X(4)  VALUE X'C311C1D1'.
            02  FILLER  PIC X(77)
                VALUE 'TESTBEC6 TEST 4:PRESS AID KEY TO HANDLE ASRA ABEN
      -               'D IN LINKED PROGRAM BY LABEL'.
        77  TEST4L   PIC 9(4) COMP.
        01  TEST4R.
            02  FILLER  PIC X(4)  VALUE X'C311C3F1'.
            02  FILLER  PIC X(45)
                VALUE 'TESTBEC6 ASRA IN TESTBEC7 HANDLED OK BY LABEL'.
        77  TEST4RL  PIC 9(4) COMP.
        01  TEST4K.
            02  FILLER  PIC X(4)  VALUE X'C311C5C1'.
            02  FILLER  PIC X(43)
                VALUE 'TESTBEC6 HANDLE ABEND RETURNED SUCCESSFULLY'.
            02  FILLER  PIC X(3)  VALUE X'11C6D1'.
            02  FILLER  PIC X(79)
                VALUE 'TESTBEC6 TEST 5:PRESS AID KEY TO HANDLE AEI0 ABEN
      -               'D IN LINKED PROGRAM BY PROGRAM'.
        77  TEST5KL  PIC 9(4) COMP.
        01  TEST6R.
            02  FILLER  PIC X(80).
        77  TEST6RL  PIC 9(4) COMP.
       77  BADFLD1   PIC S9(4) COMP-5 VALUE 0.
       77  BADFLD2   PIC S9(4) COMP-5 VALUE 0.
       PROCEDURE DIVISION.
           MOVE 0 TO BADFLD1.
           ADD 1 TO BADFLD2.
      * BEC6ASRA EQU   *
        BEC6ASRA.
            EXEC CICS SEND FROM(TEST1R) LENGTH(TEST1RL) END-EXEC.
      * B     AB2                CONTINUE TESTS
            GO TO AB2.

      * BEC5 TESTS
      *
      * BEC5     EQU   *
        BEC5.
            EXEC CICS SEND FROM(TEST4) LENGTH(TEST4L) END-EXEC.
            EXEC CICS HANDLE ABEND LABEL(BEC7ASRA) END-EXEC.
            EXEC CICS RECEIVE INTO(RECAREA) LENGTH(RECLEN) END-EXEC.
      * TESTBEC7 WILL ABEND ASRA
            EXEC CICS LINK PROGRAM('TESTBEC7') END-EXEC.

      * RETURN HERE AFTER HANDLING ASRA ABEND
            EXEC CICS SEND FROM(TEST4K) LENGTH(TEST4KL) END-EXEC.
            EXEC CICS RECEIVE INTO(RECAREA) LENGTH(RECLEN) END-EXEC.
      * TESTBEC7 WILL ABEND AEI0
            EXEC CICS LINK PROGRAM('TESTBEC7') COMMAREA(ACOMM)
                      END-EXEC.

      * RETURN HERE AFTER HANDLING AEI0 ABEND
            EXEC CICS SEND FROM(TEST5K) LENGTH(TEST5KL) END-EXEC.
            EXEC CICS HANDLE ABEND LABEL(BEC6ZZZZ) END-EXEC.
            EXEC CICS RECEIVE INTO(RECAREA) LENGTH(RECLEN) END-EXEC.
      * TAKE THE DUMP, IGNORE THE ABEND
            EXEC CICS ABEND ABCODE('ZZZZ') END-EXEC.
      * AB4      EQU   *
        AB4.
            EXEC CICS RETURN END-EXEC.

      * BEC7ASRA EQU   *
        BEC7ASRA.
            EXEC CICS SEND FROM(TEST4R) LENGTH(TEST4RL) END-EXEC.
      * B     AB2                CONTINUE TESTS
            GO TO AB2.

      * BEC6ZZZZ EQU   *
        BEC6ZZZZ.
            EXEC CICS SEND FROM(TEST6R) LENGTH(TEST6RL) END-EXEC.
      *  B     AB4                EXIT
            GO TO AB4.
