000049 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.   CBU00200.
*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000122 PROCEDURE DIVISION USING CBU-ctx line-display.
000123  PERFORM UNTIL WS-CNT = 0
000124      DISPLAY 'This will cause an infinite loop'
000125  END-PERFORM.
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000153  MOVE line-display TO l.
000154  CALL CBU-get-last-index USING CBU-ctx l	WS-CNT.
*> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
000208  DISPLAY line-display(1:WS-CNT).
*> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING
000220 END PROGRAM CBU00200.