000049 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.   CBU00007.
000051 ENVIRONMENT    DIVISION.
000052 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000072  01 str PIC X(20).
000075   01 lineToLog PIC X(255).
000089  COPY CBUC0002.
000090   LINKAGE SECTION.
000091          COPY CBUC0001.
000092      01 i PIC 9(2).
000093
000094 PROCEDURE DIVISION USING CBU-ctx i.
*> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
000095  MOVE i TO index-current-suite.
000096  ADD 1 TO nb-suite-run .
*> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
000111          CALL CBU-tests-run USING CBU-ctx.
*> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
000115  DISPLAY str.
*> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
000116  END PROGRAM CBU00007.