000010*> 
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   CTU0S3T2.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080   COPY CBUC0002.
000081*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000082   LINKAGE SECTION.
000083   COPY CBUC0001.
000084 PROCEDURE DIVISION USING CBU-ctx.
000085     PERFORM FOREVER.
000090*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000100 END PROGRAM CTU0S3T2.