000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   CTU0S3T1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080   COPY CBUC0002.
*> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
000081   LINKAGE SECTION.
*> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
000082   COPY CBUC0001.
000083 PROCEDURE DIVISION USING CBU-ctx.
*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000090 PERFORM UNTIL 1 = 1
000100 END-PERFORM.
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000110
000120 END PROGRAM CTU0S3T1.