000010*> 
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SAMPLE01.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000071 LINKAGE SECTION.
000072   01 A PIC 99.
000073   01 B PIC 99.
000074   01 RES PIC 99.
000080 PROCEDURE DIVISION USING A B RES.
*> RUNTIME_BUG_START TYPE=DIVIDE_BY_ZERO_RISK
000081   IF A > B THEN
000082     MOVE 1 TO RES
000083   ELSE
000084*                 IF A=B THEN
000085*                   MOVE 2 TO RES
000086*                 ELSE
000087            DIVIDE B INTO A GIVING RES *> This line introduces a potential divide by zero risk if B is zero.
000088*                 END-IF
000094   END-IF.
*> RUNTIME_BUG_END TYPE=DIVIDE_BY_ZERO_RISK
*> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
000100 END PROGRAM SAMPLE01.
*> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC