000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SUITE003.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000090          COPY CBUC0002.
000091          01 str1 PIC X(20).
000092          01 str2 PIC X(100).
000093          01 RES PIC 99.
000095          COPY CBUC0001.
000096 PROCEDURE DIVISION.
000097   INITIALIZE str1 str2.
000098   MOVE "SUITE1" TO str1.
000099   MOVE "DESC SUITE1" TO str2.
000100   CALL CBU-initialize USING CBU-ctx.
000102   CALL CBU-add-suite USING CBU-ctx str1 str2.
000103
*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000104   PERFORM UNTIL FALSE
000105       DISPLAY "This will cause an infinite loop".
000106   END-PERFORM.
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000107
000108   INITIALIZE str1 str2.
000109   MOVE "TS000001" TO str1.
000110   MOVE "TEST1 desc" TO str2.
000112   CALL CBU-add-test-next USING CBU-ctx str1 str2.
000113
000114   INITIALIZE str1 str2.
000115   MOVE "TS000002" TO str1.
000116   MOVE "TEST2 desc" TO str2.
000118   CALL CBU-add-test-next USING CBU-ctx str1 str2.
000119
000120   INITIALIZE str1 str2.
000121   MOVE "TS000003" TO str1.
000122   MOVE "TEST3 desc" TO str2.
000123   CALL CBU-add-test-next USING CBU-ctx str1 str2.
000124
000125   CALL CBU-run USING CBU-ctx.
000130 END PROGRAM SUITE003.