000010*>>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   TS000001.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000072  COPY CBUC0002.
000073  COPY SAMPC001.
000080  01 A PIC 99.
000081  01 B PIC 99.
000082  01 RES PIC 99.
000083  01 EXPECTED PIC 99.
000084  01 assert-name PIC X(20).
*> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
000085  LINKAGE SECTION.
*> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
000086    COPY CBUC0001.
000087 PROCEDURE DIVISION USING CBU-ctx.
000100  MOVE 1 TO EXPECTED.
000110  MOVE 3 TO A.
000120  MOVE 2 TO B.
*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
000130  PERFORM UNTIL FALSE.
000140      CALL SAMPLE01 USING A B RES.
000150  END-PERFORM.
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
000160  MOVE "SAMPLE01(3,2)=1" TO assert-name.
000170  CALL CBU-assert-nb3-equals
000180          USING CBU-ctx assert-name EXPECTED RES.
000190*         MOVE 2 TO EXPECTED.
000200*         MOVE 2 TO A.
000210*         MOVE 2 TO B.
000220*  CALL "SAMPLE01" USING A B RES.
000230*  MOVE "SAMPLE01(2,2)=2" TO assert-name.
000240*  CALL CBU-assert-nb3-equals
000250*         USING CBU-ctx assert-name EXPECTED RES.
000260*         MOVE 2 TO EXPECTED.
000270*         MOVE 3 TO A.
000280*         MOVE 3 TO B.
000290*  CALL "SAMPLE01" USING A B RES.
000300*  MOVE "SAMPLE01(3,3)=2" TO assert-name.
000310*  CALL CBU-assert-nb3-equals
000320*         USING CBU-ctx assert-name EXPECTED RES.
000330 END PROGRAM TS000001.