IDENTIFICATION DIVISION.
       PROGRAM-ID. WBGETBAL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ACCT-REC-KEY.
           05  SSN PIC X(9).
           05  NUM PIC X(6).
       01  ACCOUNT-RECORD.
           05  ACCOUNT-TYPE-CODE PIC X.
           05  ACCOUNT-CHK-BAL PIC S9(7)V9(2).
           05  ACCOUNT-SAV-BAL PIC S9(7)V9(2).
       01  LOG-MSG.
           05  LOG-MSG-BUFFER PIC X(80).
       01  RESP-CODE PIC XX.
       01  RET-CODE PIC 9 VALUE 0.
       01  HW-LENGTH PIC 9(4) VALUE 0.
       01  TASK-NUMBER PIC 9(4) VALUE 0.

       PROCEDURE DIVISION.
           MAIN-LOGIC SECTION.
           PERFORM RECEIVE-INPUT THRU RECEIVE-INPUT-EXIT.
           IF RET-CODE = 0 THEN
               PERFORM READ-ACCOUNT THRU READ-ACCOUNT-EXIT.
               IF RET-CODE = 0 THEN
                   MOVE ACCOUNT-CHK-BAL TO BALANCE-FIELD
               ELSE
                   MOVE ZERO TO BALANCE-FIELD
               END-IF.
           END-IF.
           PERFORM SEND-RESPONSE THRU SEND-RESPONSE-EXIT.
           GOBACK.

       RECEIVE-INPUT SECTION.
           EXEC CICS RECEIVE INTO(INPUT-AREA) RESP(RESP-CODE).
           EVALUATE RESP-CODE
               WHEN DFHRESP(EOC) CONTINUE
               WHEN DFHRESP(EODS) GO TO END-PROGRAM
               WHEN DFHRESP(INBFMH) GO TO END-PROGRAM
               WHEN DFHRESP(LENGERR) GO TO END-PROGRAM
               WHEN DFHRESP(SIGNAL) GO TO END-PROGRAM
               WHEN DFHRESP(TERMERR) GO TO END-PROGRAM
               WHEN OTHER GO TO END-PROGRAM.
       RECEIVE-INPUT-EXIT.
           EXIT.

       READ-ACCOUNT SECTION.
           MOVE INPUT-AREA(1:9) TO SSN OF ACCT-REC-KEY.
           MOVE INPUT-AREA(10:15) TO NUM OF ACCT-REC-KEY.
           EXEC CICS READ DATASET('WBACCTDB') INTO(ACCOUNT-RECORD)
                     RIDFLD(ACCT-REC-KEY) RESP(RESP-CODE).
           EVALUATE RESP-CODE
               WHEN 0 CONTINUE
               WHEN DFHRESP(ENDFILE) GO TO END-PROGRAM
               WHEN DFHRESP(NOTOPEN) GO TO END-PROGRAM
               WHEN OTHER GO TO END-PROGRAM.
       READ-ACCOUNT-EXIT.
           EXIT.

       SEND-RESPONSE SECTION.
           MOVE LENGTH OF OUTPUT-AREA TO OUTPUT-AREA-LEN.
           IF RET-CODE = 0 THEN
               MOVE EC-OK TO OA-STATUS-CODE
           ELSE
               MOVE LENGTH OF OA-HEADER OF OUTPUT-AREA TO
                   OUTPUT-AREA-LEN.
       SEND-RESPONSE-EXIT.
           EXIT.

       END-PROGRAM SECTION.
           EXEC CICS RETURN END-EXEC.
       END-PROGRAM-EXIT.
           EXIT.