000700********************************************************
      * Adding a non-displayable character in the next line for
      * testing purposes (it's a x'00')
      *ï¿½
000800* THIS PROGRAM IS A TRAINING PROGRAM
000900*      WITH A LINK TO TSUBR06
001000*
001100*      AND COPYLIBS   TCPYA06   (HEADER)
001200*                     TCPYB06   (LINK AREA)
001300* ======================================================
001400*  ISPW (TM)
001500*  COPYRIGHT (C) 1986-2016 COMPUWARE CORPORATION.
001600*  UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT
001700*  LAWS OF THE UNITED STATES.
001800*
001900* ======================================================
002000*                   MODIFICATION  LOG
002100*
002200*  DD/MM/YY  PROGRAMMER  CHANGES
002300*  ********  **********  *******
002400*  96/01/24  ISPW        NEW PROGRAM
002500* ======================================================
007200****************************************************
      *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
007300****    THE DATA AREA COPYBOOK
007400****************************************************
007500 COPY TCPYA06.
007600
007700
007800****************************************************
      *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
008100****************************************************
**** A COPY MEMBER FOR THE LINKAGE AREA PARAMETERS
008200 COPY TCPYB06 .
008300
008400 PROCEDURE DIVISION.
008500
008600 00000-MAIN-PROCEDURE.
008700
008800     OPEN OUTPUT OUTFILE.
008900     MOVE 'R' TO ACTION-FLAG.
009000     CALL 'TSUBR06' USING PASS-ME-AROUND.
009100
009200     IF NOT INFILE-EOF THEN
009300        MOVE TEXT-PORTION TO MESSANGER
      *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
009400
009500     MOVE SPACES TO CC.
009600     MOVE STAR-LINE-1 TO OUTPUT-REC.
009700     WRITE OUTPUT-REC.
009800     WRITE OUTPUT-REC.
009900     WRITE OUTPUT-REC.
      *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING
010000
010100     MOVE SPACES TO BODY-TEXT.
010200     MOVE BODY-LINE TO OUTPUT-REC.
010300     WRITE OUTPUT-REC.
010400     WRITE OUTPUT-REC.
010500     WRITE OUTPUT-REC.
010600
010700     MOVE FLASH-LINE TO OUTPUT-REC.
010800     WRITE OUTPUT-REC.
010900     WRITE OUTPUT-REC.
011000     WRITE OUTPUT-REC.
011100
011200     MOVE SPACES TO BODY-TEXT.
011300     MOVE BODY-LINE TO OUTPUT-REC.
011400     WRITE OUTPUT-REC.
011500     WRITE OUTPUT-REC.
011600
011700     MOVE MESSAGE-LINE TO BODY-TEXT.
011800     MOVE BODY-LINE TO OUTPUT-REC.
011900     WRITE OUTPUT-REC.
012000
012100     MOVE SPACES TO BODY-TEXT.
012200     MOVE BODY-LINE TO OUTPUT-REC.
012300     WRITE OUTPUT-REC.
012400     WRITE OUTPUT-REC.
012500
012600     MOVE STAR-LINE-1 TO OUTPUT-REC.
012700     WRITE OUTPUT-REC.
012800     WRITE OUTPUT-REC.
012900     WRITE OUTPUT-REC.
013000
013100* CLOSE THE INPUT FILE
013200     MOVE 'C' TO ACTION-FLAG.
013300     CALL 'TSUBR06' USING PASS-ME-AROUND.
013400
013500     CLOSE OUTFILE.
013600     GOBACK.
013700
013800 GET-MESSAGE.
013900        MOVE 'R' TO ACTION-FLAG.
014000        CALL 'TSUBR06' USING PASS-ME-AROUND.
014100           IF NOT INFILE-EOF THEN
014200             MOVE TEXT-PORTION TO BODY-TEXT
014300             MOVE BODY-LINE TO OUTPUT-REC
014400             WRITE OUTPUT-REC.
014500 GET-MESSAGE-X.
014600     EXIT.