000700 PROCEDURE DIVISION.
000800
000900 00000-MAIN-PROCEDURE.
001000
001100     OPEN OUTPUT OUTFILE.
001200     MOVE 'R' TO ACTION-FLAG.
001300     CALL 'TSUBR03' USING PASS-ME-AROUND.
001400
001500     IF NOT INFILE-EOF THEN
001600        MOVE TEXT-PORTION TO MESSANGER  *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
001700
001800     MOVE SPACES TO CC.
001900     MOVE STAR-LINE-1 TO OUTPUT-REC.
002000     WRITE OUTPUT-REC.
002100     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
002200     WRITE OUTPUT-REC.
002300
002400     MOVE SPACES TO BODY-TEXT.
002500     MOVE BODY-LINE TO OUTPUT-REC.
002600     WRITE OUTPUT-REC.
002700     WRITE OUTPUT-REC.
002800
002900     MOVE FLASH-LINE TO OUTPUT-REC.
003000     WRITE OUTPUT-REC.
003100     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
003200     WRITE OUTPUT-REC.
003300
003400     MOVE SPACES TO BODY-TEXT.
003500     MOVE BODY-LINE TO OUTPUT-REC.
003600     WRITE OUTPUT-REC.
003700     WRITE OUTPUT-REC.
003800
003900     MOVE MESSAGE-LINE TO BODY-TEXT.
004000     MOVE BODY-LINE TO OUTPUT-REC.
004100     WRITE OUTPUT-REC.
004200
004300     MOVE SPACES TO BODY-TEXT.
004400     MOVE BODY-LINE TO OUTPUT-REC.
004500     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
004600
004700     PERFORM GET-MESSAGE THRU GET-MESSAGE-X
004800        UNTIL INFILE-EOF.
004900
005000     MOVE SPACES TO BODY-TEXT.
005100     MOVE BODY-LINE TO OUTPUT-REC.
005200     WRITE OUTPUT-REC.
005300     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
005400
005500* CLOSE THE INPUT FILE
005600     MOVE 'C' TO ACTION-FLAG.
005700     CALL 'TSUBR03' USING PASS-ME-AROUND.
005800
005900     CLOSE OUTFILE.
006000     GOBACK.
006100
006200 GET-MESSAGE.
006300        MOVE 'R' TO ACTION-FLAG.
006400        CALL 'TSUBR03' USING PASS-ME-AROUND.
006500           IF NOT INFILE-EOF THEN
006600             MOVE TEXT-PORTION TO BODY-TEXT
006700             MOVE BODY-LINE TO OUTPUT-REC
006800             WRITE OUTPUT-REC.
006900 GET-MESSAGE-X.
007000     EXIT.