000700 PROCEDURE DIVISION.
008600     00000-MAIN-PROCEDURE.
008900         MOVE 'R' TO ACTION-FLAG.
014300         CALL 'TSUBR08' USING PASS-ME-AROUND.
014500             IF NOT INFILE-EOF THEN
014600               MOVE TEXT-PORTION TO BODY-TEXT
014700               MOVE BODY-LINE TO OUTPUT-REC
014800               WRITE OUTPUT-REC.