PROCEDURE DIVISION.
008400
008500 00000-MAIN-PROCEDURE.
008600
008700     OPEN OUTPUT OUTFILE.
008800     MOVE 'R' TO ACTION-FLAG.
008900     CALL 'TSUBR01' USING PASS-ME-AROUND.
009000
009100     IF NOT INFILE-EOF THEN
009200        *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
009300        MOVE TEXT-PORTION TO MESSANGER
009400        *> RUNTIME_BUG_END TYPE=WRONG_CALCULATION_LOGIC
009500     END-IF.
009600     MOVE SPACES TO CC.
009700     MOVE STAR-LINE-1 TO OUTPUT-REC.
009800     WRITE OUTPUT-REC.
009900     WRITE OUTPUT-REC.
010000     WRITE OUTPUT-REC.
010100
010200     MOVE SPACES TO BODY-TEXT.
010300     MOVE BODY-LINE TO OUTPUT-REC.
010400     WRITE OUTPUT-REC.
010500     WRITE OUTPUT-REC.
010600     WRITE OUTPUT-REC.
010700     WRITE OUTPUT-REC.
010800
010900     MOVE SPACES TO BODY-TEXT.
011000     MOVE BODY-LINE TO OUTPUT-REC.
011100     WRITE OUTPUT-REC.
011200     WRITE OUTPUT-REC.
011300     WRITE OUTPUT-REC.
011400
011500     MOVE MESSAGE-LINE TO BODY-TEXT.
011600     MOVE BODY-LINE TO OUTPUT-REC.
011700     WRITE OUTPUT-REC.
011800
011900     MOVE SPACES TO BODY-TEXT.
012000     MOVE BODY-LINE TO OUTPUT-REC.
012100     WRITE OUTPUT-REC.
012200     WRITE OUTPUT-REC.
012300        *> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
012400        PERFORM GET-MESSAGE THRU GET-MESSAGE-X
012500           UNTIL INFILE-EOF.
012600     MOVE SPACES TO BODY-TEXT.
012700     MOVE BODY-LINE TO OUTPUT-REC.
012800        *> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING
012900     WRITE OUTPUT-REC.
013000
013100     MOVE STAR-LINE-1 TO OUTPUT-REC.
013200     WRITE OUTPUT-REC.
013300     WRITE OUTPUT-REC.
013400     WRITE OUTPUT-REC.
013500* CLOSE THE INPUT FILE
013600     MOVE 'C' TO ACTION-FLAG.
013700     CALL 'TSUBR01' USING PASS-ME-AROUND.
013800
013900     CLOSE OUTFILE.
014000     GOBACK.
014100
014200 GET-MESSAGE.
014300        MOVE 'R' TO ACTION-FLAG.
014400        CALL 'TSUBR01' USING PASS-ME-AROUND.
014500           IF NOT INFILE-EOF THEN
014600             MOVE TEXT-PORTION TO BODY-TEXT
014700             MOVE BODY-LINE TO OUTPUT-REC
014800             WRITE OUTPUT-REC.
014900 GET-MESSAGE-X.
015000     EXIT.
>>>COBOL_END