IDENTIFICATION DIVISION.
000800 PROGRAM-ID.    TPROG05.
000900 AUTHOR.        COMPUWARE ISPW TRAINING.
001000 DATE-WRITTEN.  JANUARY 24TH, 1996.
001100 DATE-COMPILED.
001200
001300********************************************************
001400* THIS PROGRAM IS A TRAINING PROGRAM
001500*      WITH A LINK TO TSUBR05
001600*
001700*      AND COPYLIBS   TCPYA05   (HEADER)
001800*                     TCPYB05   (LINK AREA)
001900* ======================================================
002000*  ISPW (TM)
002100*  COPYRIGHT (C) 1986-2016 COMPUWARE CORPORATION.
002200*  UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT
002300*  LAWS OF THE UNITED STATES.
002400*
002500* ======================================================
002600*                   MODIFICATION  LOG
002700*
002800*  DD/MM/YY  PROGRAMMER  CHANGES
002900*  ********  **********  *******
003000*  96/01/24  ISPW        NEW PROGRAM
003100* ======================================================
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER. IBM-370.
003500 OBJECT-COMPUTER. IBM-370.
003600
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900
004000*****************************************************
004100*  FILES USED:
004200*   INPUT   JUST SOME DUMMY DATA TO READ IN
004300*   OUTPUT  A COPY OF THE DUMMY DATA WRITTEN OUT
004400*****************************************************
004500     SELECT INFILE  ASSIGN UT-S-INPUT
004600       ORGANIZATION IS SEQUENTIAL
004700       ACCESS IS SEQUENTIAL.
004800
004900     SELECT OUTFILE ASSIGN UT-S-OUTPUT
005000       ORGANIZATION IS SEQUENTIAL
005100       ACCESS IS SEQUENTIAL.
005200
005300 DATA DIVISION.
005400
005500 FILE SECTION.
005600
005700 FD  INFILE
005800     LABEL RECORDS OMITTED
005900     BLOCK CONTAINS 0 RECORDS
006000     RECORDING MODE IS F
006100     DATA RECORD IS INPUT-REC.
006200
006300 01  INPUT-REC         PIC X(80).
006400
006500 FD  OUTFILE
006600     LABEL RECORDS OMITTED
006700     BLOCK CONTAINS 0 RECORDS
006800     RECORDING MODE IS F
006900     DATA RECORD IS OUTPUT-REC.
007000
007100 01  OUTPUT-REC.
007200     05  CC                PIC X(1).
007300     05  OUTPUT-LINE       PIC X(132).
007400
007500
007600 WORKING-STORAGE SECTION.
007700****************************************************
007800****    THE DATA AREA COPYBOOK
007900****************************************************
008000 COPY TCPYA05.
008100
008200
008300
008400****************************************************
008500**** A COPY MEMBER FOR THE LINKAGE AREA PARAMETERS
008600****************************************************
008700 COPY TCPYB05 .
008800
008900 PROCEDURE DIVISION.
009000
009100 00000-MAIN-PROCEDURE.
009200
009300     OPEN OUTPUT OUTFILE.
009400     MOVE 'R' TO ACTION-FLAG.
009500     CALL 'TSUBR05' USING PASS-ME-AROUND.
009600
009700     IF NOT INFILE-EOF THEN
009800        MOVE TEXT-PORTION TO MESSANGER *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
009900
010000     MOVE SPACES TO CC.
010100     MOVE STAR-LINE-1 TO OUTPUT-REC.
010200     WRITE OUTPUT-REC. *> RUNTIME_BUG_START TYPE=DIVIDE_BY_ZERO_RISK
010300     WRITE OUTPUT-REC.
010400     WRITE OUTPUT-REC.
010500
010600     MOVE SPACES TO BODY-TEXT.
010700     MOVE BODY-LINE TO OUTPUT-REC.
010800     WRITE OUTPUT-REC.
010900     WRITE OUTPUT-REC.
011000
011100     MOVE FLASH-LINE TO OUTPUT-REC.
011200     WRITE OUTPUT-REC.
011300     WRITE OUTPUT-REC.
011400     WRITE OUTPUT-REC.
011500
011600     MOVE SPACES TO BODY-TEXT.
011700     MOVE BODY-LINE TO OUTPUT-REC.
011800     WRITE OUTPUT-REC. *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
011900     WRITE OUTPUT-REC.
012000
012100     MOVE MESSAGE-LINE TO BODY-TEXT.
012200     MOVE BODY-LINE TO OUTPUT-REC.
012300     WRITE OUTPUT-REC.
012400
012500     MOVE STAR-LINE-1 TO OUTPUT-REC.
012600     WRITE OUTPUT-REC.
012700     WRITE OUTPUT-REC.
012800     WRITE OUTPUT-REC.
012900
013000* CLOSE THE INPUT FILE
013100     MOVE 'C' TO ACTION-FLAG.
013200     CALL 'TSUBR05' USING PASS-ME-AROUND.
013300
013400     CLOSE OUTFILE.
013500     GOBACK.
013600
013700 GET-MESSAGE.
013800        MOVE 'R' TO ACTION-FLAG.
013900        CALL 'TSUBR05' USING PASS-ME-AROUND.
014000           IF NOT INFILE-EOF THEN
014100             MOVE TEXT-PORTION TO BODY-TEXT
014200             MOVE BODY-LINE TO OUTPUT-REC
014300             WRITE OUTPUT-REC.
014400 GET-MESSAGE-X.
014500     EXIT.
>>>COBOL_END