000700 PROCEDURE DIVISION.
000800
000900 00000-MAIN-PROCEDURE.
001000
001100     OPEN OUTPUT OUTFILE.
001200     MOVE 'R' TO ACTION-FLAG.
001300     CALL 'TSUBR07' USING PASS-ME-AROUND.
001400
001500     IF NOT INFILE-EOF THEN
001600        MOVE TEXT-PORTION TO MESSANGER  *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
001700
001800     MOVE SPACES TO CC.
001900     MOVE STAR-LINE-1 TO OUTPUT-REC.
002000     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
002100     WRITE OUTPUT-REC.
002200     WRITE OUTPUT-REC.
002300
002400     MOVE SPACES TO BODY-TEXT.
002500     MOVE BODY-LINE TO OUTPUT-REC.
002600     WRITE OUTPUT-REC.
002700     WRITE OUTPUT-REC.
002800
002900     MOVE FLASH-LINE TO OUTPUT-REC.
003000     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
003100     WRITE OUTPUT-REC.
003200     WRITE OUTPUT-REC.
003300     WRITE OUTPUT-REC.
003400
003500     MOVE SPACES TO BODY-TEXT.
003600     MOVE BODY-LINE TO OUTPUT-REC.
003700     WRITE OUTPUT-REC.
003800     WRITE OUTPUT-REC.
003900
004000     MOVE MESSAGE-LINE TO BODY-TEXT.
004100     MOVE BODY-LINE TO OUTPUT-REC.
004200     WRITE OUTPUT-REC.
004300
004400     MOVE SPACES TO BODY-TEXT.
004500     MOVE BODY-LINE TO OUTPUT-REC.
004600     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
004700     WRITE OUTPUT-REC.
004800
004900     MOVE MESSAGE-LINE TO BODY-TEXT.
005000     MOVE BODY-LINE TO OUTPUT-REC.
005100     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
005200
005300     PERFORM GET-MESSAGE THRU GET-MESSAGE-X
005400        UNTIL INFILE-EOF.
005500
005600     MOVE SPACES TO BODY-TEXT.
005700     MOVE BODY-LINE TO OUTPUT-REC.
005800     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
005900     WRITE OUTPUT-REC.
006000     WRITE OUTPUT-REC.
006100
006200     MOVE STAR-LINE-1 TO OUTPUT-REC.
006300     WRITE OUTPUT-REC.  *> RUNTIME_BUG_START TYPE=WRONG_CALCULATION_LOGIC
006400     WRITE OUTPUT-REC.
006500     WRITE OUTPUT-REC.
006600     WRITE OUTPUT-REC.
006700
006800* CLOSE THE INPUT FILE
006900     MOVE 'C' TO ACTION-FLAG.
007000     CALL 'TSUBR07' USING PASS-ME-AROUND.
007100
007200     CLOSE OUTFILE.
007300     GOBACK.
007400
007500 GET-MESSAGE.
007600        MOVE 'R' TO ACTION-FLAG.
007700        CALL 'TSUBR07' USING PASS-ME-AROUND.
007800           IF NOT INFILE-EOF THEN
007900             MOVE TEXT-PORTION TO BODY-TEXT
008000             MOVE BODY-LINE TO OUTPUT-REC
008100             WRITE OUTPUT-REC.
008200 GET-MESSAGE-X.
008300     EXIT.