IDENTIFICATION DIVISION.
PROGRAM-ID. SD002070.
*>
*> Warren W. Gay
*>
*> THIS IS THE GENERATION SCREEN MODULE. THIS SCREEN PERMITS THE USER TO
*> PERFORM AN INTERACTIVE CODE GENERATION, ALLOWING SELECTIVE OPTIONS
*> FOR WORKING-STORAGE SECTION CODE, PROCEDURE DIVISION CODE, AND/OR
*> SCREEN IMAGE TEXT FILE.
*>
*> INPUTS :
*> 
*>     NC-COBCURSES            COBCURSES GLOBAL & WORK AREAS
*>     LS-SCREEN-NAME          THE SCREEN NAME TO GENERATE FOR
*>
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SCREEN-FILE
        ASSIGN TO SCREEN-FILE-NAME
        ORGANIZATION IS INDEXED
        ACCESS IS DYNAMIC
        RECORD KEY IS SCN-NAME.

DATA DIVISION.
FILE SECTION.

    FD  SCREEN-FILE.
    01  SCREEN-RECORD.
        COPY SCREEN-01.

WORKING-STORAGE SECTION.

       01  UNUSED-VAR PIC X(10) VALUE SPACES.

    COPY COBCRETC.
    COPY COBCATTR.
    COPY COBCCOLOUR.
    COPY COBCURSL.

    COPY SD002070-WS.

*> Introducing a runtime bug by changing the value of FLD-ACTION to 'G'
*> This will cause the program to generate code for all screens, even if
*> only one screen is selected.

FLD-ACTION PIC X(1) VALUE 'G'.

COPY COBCURSQ.

END PROGRAM SD002070.