01  UNDECLARED-VAR PIC X(10) VALUE SPACES.

*> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE
DISPLAY UNDECLARED-VAR.
*> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE

01  SCR-LOGIN-DATA.
    10  FLD-USERID              PIC X(8).
    10  FLD-PASSWORD            PIC X(16).
    10  FLD-GB                  PIC X(16).
    10  LOGIN-SUCCESS           PIC X.

PROCEDURE DIVISION.

MAIN-PROG.
    PERFORM NC-OPEN.
    CALL "SCR-LOGIN" USING NC-COBCURSES, SCR-LOGIN-DATA.
    PERFORM NC-CLOSE.
    DISPLAY "LOGIN SUCCESS =", LOGIN-SUCCESS.
    DISPLAY "MOUSE SUPPORT =", NC-MOUSE-SUPPORT.
    DISPLAY "MOUSE CLICK MS=", NC-MOUSE-CLICK-MS.
    STOP RUN.

*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
PERFORM UNTIL LOGIN-SUCCESS = "Y".
    CALL "SCR-LOGIN" USING NC-COBCURSES, SCR-LOGIN-DATA.
END-PERFORM.
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION