IDENTIFICATION DIVISION.
       PROGRAM-ID.  GERANDORELATORIO.
      *********************************
      * OBJETIVO:  GERANDORELATORIO
      * AUTHOR  :  LRM
      *********************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIENTES ASSIGN TO 'E:\COBOL\CLIENTES.DAT'
             ORGANIZATION IS INDEXED
             ACCESS MODE IS DYNAMIC
             FILE STATUS IS CLIENTES-STATUS
             RECORD KEY IS  CLIENTES-CHAVE.
       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES.
       01 CLIENTES-REG.
            05 CLIENTES-CHAVE.
                10 CLIENTES-FONE PIC 9(09).
            05 CLIENTES-NOME     PIC X(30).
            05 CLIENTES-EMAIL    PIC X(40).

       WORKING-STORAGE SECTION.
       01  UNUSED-VAR PIC X(10) VALUE SPACES.

       77 WRK-OPCAO       PIC X(1).
       77 WRK-MODULO      PIC X(25).
       77 WRK-TECLA       PIC X(1).
       77 CLIENTES-STATUS PIC 9(02).
       77 WRK-MSGERRO     PIC X(30).

       SCREEN SECTION.
       01 TELA.
            05 LIMPA-TELA.
                10 BLANK SCREEN.
                10 LINE 01 COLUMN 01 PIC X(20) ERASE EOL
                   BACKGROUND-COLOR 3.
                10 LINE 01 COLUMN 25 PIC X(20)
                   BACKGROUND-COLOR 3  FOREGROUND-COLOR 0
                              FROM 'SISTEMA DE CLIENTES '.
                10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
                   BACKGROUND-COLOR 1 FROM WRK-MODULO.
       01 MENU.
            05 LINE 07 COLUMN 15 VALUE '1 - INCLUIR'.
            05 LINE 08 COLUMN 15 VALUE '2 - CONSULTAR'.
            05 LINE 09 COLUMN 15 VALUE '3 - ALTERAR'.
            05 LINE 10 COLUMN 15 VALUE '4 - EXCLUIR'.
            05 LINE 11 COLUMN 15 VALUE '5 - RELATORIO'.
            05 LINE 12 COLUMN 15 VALUE 'X - SAIDA'.
            05 LINE 13 COLUMN 15 VALUE 'OPCAO......: ' .
            05 LINE 13 COLUMN 28 USING WRK-OPCAO.

       01 TELA-REGISTRO.
            05 CHAVE FOREGROUND-COLOR 2.
               10 LINE 10 COLUMN 10 VALUE 'TELEFONE '.
               10 COLUMN PLUS 2 PIC 9(09) USING CLIENTES-FONE
                   BLANK WHEN ZEROS.
            05 SS-DADOS.
               10 LINE 11 COLUMN 10 VALUE 'NOME.... '.
               10 COLUMN PLUS 2 PIC X(30) USING CLIENTES-NOME.
               10 LINE 12 COLUMN 10 VALUE 'EMAIL... '.
               10 COLUMN PLUS 2 PIC X(40) USING CLIENTES-EMAIL.
       01 MOSTRA-ERRO.
             02 MSG-ERRO.
               10 LINE 16 COLUMN 01 ERASE EOL
                             BACKGROUND-COLOR 3.
               10 LINE 16 COLUMN 10 PIC X(30)
                             BACKGROUND-COLOR 3
                             FROM WRK-MSGERRO.
               10 COLUMN PLUS 2 PIC X(01)
                             BACKGROUND-COLOR 3
                             USING WRK-TECLA.

       PROCEDURE DIVISION.
       0001-PRINCIPAL SECTION.
            PERFORM 1000-INICIAR
            PERFORM UNTIL WRK-OPCAO = 'X'
                DISPLAY TELA
                ACCEPT MENU
                EVALUATE WRK-OPCAO
                    WHEN '1' PERFORM 2000-INCLUIR
                    WHEN '2' PERFORM 3000-CONSULTAR
                    WHEN '3' PERFORM 4000-ALTERAR
                    WHEN '4' PERFORM 5000-EXCLUIR
                    WHEN '5' PERFORM 6000-RELATORIO
                END-EVALUATE
            END-PERFORM.
       0002-SAIR SECTION.
            DISPLAY 'SAINDO DO SISTEMA...'.
            STOP RUN.

       **********************************************
       *    SUBROUTINAS DE OPERACOES COM O BANCO   *
       **********************************************
       1000-INICIAR SECTION.
           DISPLAY 'BEM VINDO AO SISTEMA DE GESTAO DE CLIENTES'.
           MOVE 0 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       1001-FINALIZAR SECTION.
           DISPLAY 'FIM DO PROGRAMA'.
           STOP RUN.

       **********************************************
       *    SUBROUTINAS DE OPERACOES COM O BANCO   *
       **********************************************
       2000-INCLUIR SECTION.
           DISPLAY 'INSERIR NOVO CLIENTE'.
           MOVE 1 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       3000-CONSULTAR SECTION.
           DISPLAY 'CONSULTAR CLIENTE'.
           MOVE 2 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       4000-ALTERAR SECTION.
           DISPLAY 'ALTERAR DADOS DO CLIENTE'.
           MOVE 3 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       5000-EXCLUIR SECTION.
           DISPLAY 'EXCLUIR CLIENTE'.
           MOVE 4 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       6000-RELATORIO SECTION.
           DISPLAY 'GERAR RELATORIO DE CLIENTES'.
           MOVE 5 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.

       **********************************************
       *    SUBROUTINAS DE OPERACOES COM O BANCO   *
       **********************************************
       7000-ABRIR SECTION.
           DISPLAY 'ABRIR ARQUIVO'.
           MOVE 1 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       8000-FECHAR SECTION.
           DISPLAY 'FECHAR ARQUIVO'.
           MOVE 2 TO WRK-OPCAO.
           PERFORM 9000-LIMPAR.
       9000-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9001-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9002-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9003-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9004-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9005-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9006-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9007-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9008-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9009-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9010-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9011-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9012-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9013-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9014-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9015-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9016-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9017-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9018-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9019-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9020-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9021-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9022-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9023-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9024-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9025-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9026-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9027-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9028-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9029-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9030-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9031-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9032-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9033-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9034-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9035-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9036-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9037-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9038-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9039-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9040-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9041-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9042-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9043-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9044-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9045-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9046-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK-TECLA.
           MOVE ZEROS TO CLIENTES-STATUS.
       9047-LIMPAR SECTION.
           DISPLAY 'LIMPAR TELA'.
           MOVE SPACES TO UNUSED-VAR.
           MOVE ZEROS TO CLIENTES-FONE.
           MOVE SPACES TO CLIENTES-NOME.
           MOVE SPACES TO CLIENTES-EMAIL.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE SPACES TO WRK