01  WS-FLAG PIC X VALUE 'N'.

87 FIB1 PIC 999.
87 FIB2 PIC 999.
87 FIB3 PIC 999.
87 I PIC 99.
87 FIBST PIC XXX.
87 RES PIC X(64).

PROCEDURE DIVISION.
DISPLAY UNDECLARED-VAR.

IF WS-FLAG = 'Y'
    DISPLAY "FLAG-SET".
END-IF.

MOVE 0 TO I 
MOVE 0 TO FIB1
MOVE 1 TO FIB2
MOVE SPACES TO RES
PERFORM UNTIL I GREATER THAN 15
    ADD FIB1 TO FIB2 GIVING FIB3
        MOVE FIB2 TO FIB1
        MOVE FIB3 TO FIB2
        MOVE FIB1 TO FIBST
        STRING RES DELIMITED BY SPACE
            FIBST DELIMITED BY SIZE
            ","   DELIMITED BY SIZE INTO RES
            ADD 1 TO I
END-PERFORM.
DISPLAY RES "..."
STOP RUN.