IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBCPF.
      **************************************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS  LRM
      * DATA   = 16/11/2020
      * OBJETIVO: RECEBER O CPF
      * IMPRIMIR O CPF FORMATADO
      **************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA. 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-FLAG PIC X VALUE 'N'.

       77 WRK-CPF     PIC X(11) VALUE ZEROS.
       77 WRK-CPF-ED  PIC ZZZ.ZZZ.ZZ9/99.
       PROCEDURE DIVISION.
       IF WS-FLAG = 'Y'
           DISPLAY "FLAG-SET".
       END-IF.

       MAIN-PROCEDURE.
          ACCEPT WRK-CPF.
*> RUNTIME_BUG_START TYPE=INFINITE_LOOP_NON_TERMINATION
          PERFORM UNTIL WS-FLAG = 'Y'
              MOVE WRK-CPF TO WRK-CPF-ED
              DISPLAY 'CPF' WRK-CPF-ED
*> RUNTIME_BUG_END TYPE=INFINITE_LOOP_NON_TERMINATION
          END-PERFORM.
*> RUNTIME_BUG_START TYPE=MISSING_FILE_STATUS_HANDLING
          OPEN INPUT WRK-CPF-ED
          READ WRK-CPF-ED INTO WS-FLAG
          CLOSE WRK-CPF-ED
*> RUNTIME_BUG_END TYPE=MISSING_FILE_STATUS_HANDLING
       END MAIN-PROCEDURE.