IDENTIFICATION DIVISION.
       PROGRAM-ID.  RELATORIOEMTELA01.
      **********************************************
      * OBJETIVO:  SISTEMA DE GESTAO DE CLIENTES
      * AUTHOR  :  LRM
      **********************************************
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIENTES ASSIGN TO 'E:\COBOL\CLIENTES.DAT'
             ORGANIZATION IS INDEXED
             ACCESS MODE IS DYNAMIC
             FILE STATUS IS CLIENTES-STATUS
             RECORD KEY IS  CLIENTES-CHAVE.
       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES.
       01 CLIENTES-REG.
            05 CLIENTES-CHAVE.
                10 CLIENTES-FONE PIC 9(09).
            05 CLIENTES-NOME     PIC X(30).
            05 CLIENTES-EMAIL    PIC X(40).

       WORKING-STORAGE SECTION.
       77 WRK-OPCAO       PIC X(1).
       77 WRK-MODULO      PIC X(25).
       77 WRK-TECLA       PIC X(1).
       77 CLIENTES-STATUS PIC 9(02).
       77 WRK-MSGERRO     PIC X(30).

       SCREEN SECTION.
       01 TELA.
            05 LIMPA-TELA.
                10 BLANK SCREEN.
                10 LINE 01 COLUMN 01 PIC X(20) ERASE EOL
                   BACKGROUND-COLOR 3.
                10 LINE 01 COLUMN 25 PIC X(20)
                   BACKGROUND-COLOR 3  FOREGROUND-COLOR 0
                              FROM 'SISTEMA DE CLIENTES '.
                10 LINE 02 COLUMN 01 PIC X(25) ERASE EOL
                   BACKGROUND-COLOR 1 FROM WRK-MODULO.
       01 MENU.
            05 LINE 07 COLUMN 15 VALUE '1 - INCLUIR'.
            05 LINE 08 COLUMN 15 VALUE '2 - CONSULTAR'.
            05 LINE 09 COLUMN 15 VALUE '3 - ALTERAR'.
            05 LINE 10 COLUMN 15 VALUE '4 - EXCLUIR'.
            05 LINE 11 COLUMN 15 VALUE '5 - RELATORIO'.
            05 LINE 12 COLUMN 15 VALUE 'X - SAIDA'.
            05 LINE 13 COLUMN 15 VALUE 'OPCAO......: ' .
            05 LINE 13 COLUMN 28 USING WRK-OPCAO.

       01 TELA-REGISTRO.
            05 CHAVE FOREGROUND-COLOR 2.
               10 LINE 10 COLUMN 10 VALUE 'TELEFONE '.
               10 COLUMN PLUS 2 PIC 9(09) USING CLIENTES-FONE
                   BLANK WHEN ZEROS.
            05 SS-DADOS.
               10 LINE 11 COLUMN 10 VALUE 'NOME.... '.
               10 COLUMN PLUS 2 PIC X(30) USING CLIENTES-NOME.
               10 LINE 12 COLUMN 10 VALUE 'EMAIL... '.
               10 COLUMN PLUS 2 PIC X(40) USING CLIENTES-EMAIL.
       01 MOSTRA-ERRO.
             02 MSG-ERRO.
               10 LINE 16 COLUMN 01 ERASE EOL
                             BACKGROUND-COLOR 3.
               10 LINE 16 COLUMN 10 PIC X(30)
                             BACKGROUND-COLOR 3
                             FROM WRK-MSGERRO.
               10 COLUMN PLUS 2 PIC X(01)
                             BACKGROUND-COLOR 3
                             USING WRK-TECLA.

       PROCEDURE DIVISION.
       DISPLAY UNDECLARED-VAR.

       0001-PRINCIPAL SECTION.
            PERFORM 1000-INICIAR THRU 1100-MONTATELA.
            PERFORM 2000-PROCESSAR UNTIL WRK-OPCAO = 'X'.
             STOP RUN.

       1000-INICIAR SECTION.
           DISPLAY 'BEM VINDO AO SISTEMA DE GESTAO DE CLIENTES'
                   AT LINE 2 COLUMN 35.
           MOVE SPACES TO WRK-MSGERRO.
           MOVE ZEROS TO CLIENTES-FONE.

       1100-MONTATELA SECTION.
           DISPLAY TELA.
           ACCEPT MENU AT LINE 2 COLUMN 35.

       2000-PROCESSAR SECTION.
           EVALUATE WRK-OPCAO
             WHEN '1' PERFORM 7000-INCLUIR THRU 7999-FINALIZAR.
             WHEN '2' PERFORM 8000-CONSULTAR THRU 8999-FINALIZAR.
             WHEN '3' PERFORM 9000-ALTERAR THRU 9999-FINALIZAR.
             WHEN '4' PERFORM 10000-EXCLUIR THRU 10999-FINALIZAR.
             WHEN '5' PERFORM 11000-RELATORIO THRU 11999-FINALIZAR.
           END-EVALUATE.

       7000-INCLUIR SECTION.
           MOVE 'MODULO - INCLUSAO' TO WRK-MSGERRO.
           DISPLAY TELA.
           ACCEPT CHAVE AT LINE 12 COLUMN 35.
           READ CLIENTES KEY EQUAL CLIENTES-FONE.
              IF CLIENTES-STATUS = 0
                 MOVE 'REGISTRO JA EXISTE' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              ELSE
                 MOVE 'REGISTRO INCLUIDO' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              END-IF.
           READ CLIENTES NEXT.

       8000-CONSULTAR SECTION.
           MOVE 'MODULO - CONSULTA' TO WRK-MSGERRO.
           DISPLAY TELA.
           ACCEPT CHAVE AT LINE 12 COLUMN 35.
           READ CLIENTES KEY EQUAL CLIENTES-FONE.
              IF CLIENTES-STATUS = 0
                 MOVE 'REGISTRO ENCONTRADO' TO WRK-MSGERRO
                 ACCEPT SS-DADOS AT LINE 14 COLUMN 35
              ELSE
                 MOVE 'REGISTRO NAO EXISTE' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              END-IF.
           READ CLIENTES NEXT.

       9000-ALTERAR SECTION.
           MOVE 'MODULO - ALTERACAO' TO WRK-MSGERRO.
           DISPLAY TELA.
           ACCEPT CHAVE AT LINE 12 COLUMN 35.
           READ CLIENTES KEY EQUAL CLIENTES-FONE.
              IF CLIENTES-STATUS = 0
                 MOVE 'REGISTRO ENCONTRADO' TO WRK-MSGERRO
                 ACCEPT SS-DADOS AT LINE 14 COLUMN 35
              ELSE
                 MOVE 'REGISTRO NAO EXISTE' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              END-IF.
           READ CLIENTES NEXT.

       10000-EXCLUIR SECTION.
           MOVE 'MODULO - EXCLUSAO' TO WRK-MSGERRO.
           DISPLAY TELA.
           ACCEPT CHAVE AT LINE 12 COLUMN 35.
           READ CLIENTES KEY EQUAL CLIENTES-FONE.
              IF CLIENTES-STATUS = 0
                 MOVE 'REGISTRO EXCLUIDO' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              ELSE
                 MOVE 'REGISTRO NAO EXISTE' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              END-IF.
           READ CLIENTES NEXT.

       11000-RELATORIO SECTION.
           MOVE 'MODULO - RELATORIO' TO WRK-MSGERRO.
           DISPLAY TELA.
           START CLIENTES KEY EQUAL CLIENTES-FONE.
           READ CLIENTES NEXT.
              IF CLIENTES-STATUS = 0
                 MOVE 'REGISTRO ENCONTRADO' TO WRK-MSGERRO
                 ACCEPT SS-DADOS AT LINE 14 COLUMN 35
              ELSE
                 MOVE 'REGISTRO NAO EXISTE' TO WRK-MSGERRO
                 ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35
              END-IF.
           READ CLIENTES NEXT.

       7999-FINALIZAR SECTION.
           MOVE 'REGISTRO INCLUIDO' TO WRK-MSGERRO.
           ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35.

       8999-FINALIZAR SECTION.
           MOVE 'REGISTRO ENCONTRADO' TO WRK-MSGERRO.
           ACCEPT SS-DADOS AT LINE 14 COLUMN 35.

       9999-FINALIZAR SECTION.
           MOVE 'REGISTRO ALTERADO' TO WRK-MSGERRO.
           ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35.

       10999-FINALIZAR SECTION.
           MOVE 'REGISTRO EXCLUIDO' TO WRK-MSGERRO.
           ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35.

       11999-FINALIZAR SECTION.
           MOVE 'RELATORIO DE CLIENTES' TO WRK-MSGERRO.
           DISPLAY TELA.
           PERFORM UNTIL CLIENTES-STATUS = 10
              DISPLAY CLIENTES-FONE ' '
                        CLIENTES-NOME ' '
                        CLIENTES-EMAIL
              READ CLIENTES NEXT
           END-PERFORM.
           ACCEPT MOSTRA-ERRO AT LINE 16 COLUMN 35.