```cobol
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello-world.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 UNDECLARED-VAR PIC X(10). *> RUNTIME_BUG_START TYPE=UNINITIALIZED_DATA_ITEM_USE

       PROCEDURE DIVISION.
       DISPLAY UNDECLARED-VAR.

       GO TO ERR-HANDLER.

       DISPLAY "NORMAL-FLOW".

       ERR-HANDLER.
           DISPLAY "ERROR-HANDLED".
           EXIT.

           DISPLAY "Hello, world!" *> RUNTIME_BUG_END TYPE=UNINITIALIZED_DATA_ITEM_USE
```